{
  "version": "1.0",
  "encoding": "UTF-8",
  "courses": [
    {
      "number": "15-129",
      "title": "Freshman Immigration",
      "units": "3",
      "dependencies": "",
      "category": "Core",
      "url": "http://www.qatar.cmu.edu/~kharras/courses/15128",
      "visible": "TRUE",
      "semester": "F1",
      "description": "The Freshman Immigration Course is taken by first-semester Computer Science majors. The course is designed to acquaint incoming majors with computer science at CMU. Talks range from historical perspectives in the field to descriptions of the cutting edge research being conducted. 15-129 is a 3-unit course and is graded pass/fail. Enrolment is limited to SCS Freshmen ONLY."
    },
    {
      "number": "15-112",
      "title": "Fundamentals of Programming",
      "units": "12",
      "dependencies": "",
      "category": "Core",
      "url": "",
      "visible": "TRUE",
      "semester": "F1",
      "description": "A technical introduction to the fundamentals of programming with an emphasis on producing clear, robust, and reasonably efficient code using top-down design, informal analysis, and effective testing and debugging. Starting from first principles, we will cover a large subset of the Python programming language, including its standard libraries and programming paradigms. We will also target numerous deployment scenarios, including standalone programs, shell scripts, and web-based applications. This course assumes no prior programming experience. Even so, it is a fast-paced and rigorous preparation for 15-122. Students seeking a more gentle introduction to computer science should consider first taking 15-110. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course."
    },
    {
      "number": "21-127",
      "title": "Concepts of Mathematics",
      "units": "10",
      "dependencies": "",
      "category": "Math",
      "url": "",
      "visible": "TRUE",
      "semester": "F1",
      "description": "This course introduces the basic concepts, ideas and tools involved in doing mathematics. As such, its main focus is on presenting informal logic, and the methods of mathematical proof. These subjects are closely related to the application of mathematics in many areas, particularly computer science. Topics discussed include a basic introduction to elementary number theory, induction, the algebra of sets, relations, equivalence relations, congruences, partitions, and functions, including injections, surjections, and bijections."
    },
    {
      "number": "21-120",
      "title": "Differential and Integral Calculus",
      "units": "10",
      "dependencies": "",
      "category": "Math",
      "url": "",
      "visible": "TRUE",
      "semester": "F1",
      "description": "Functions, limits, derivatives, logarithmic, exponential, and trigonometric functions, inverse functions; L'Hospital's Rule, curve sketching, Mean Value Theorem, related rates, linear and quadratic approximations, maximum-minimum problems, inverse functions, definite and indefinite integrals, and hyperbolic functions; applications of integration, integration by substitution and by parts."
    },
    {
      "number": "76-100",
      "title": "Reading and Writing in an Academic Context",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "TRUE",
      "semester": "F1",
      "description": "76-100 is a requirement for students who identify themselves as non-native English speakers and who qualify for the course through an online placement test. The course is aimed toward English learners who may be highly proficient but who still need instruction about the rhetorical and linguistic demands for academic reading and writing in an American university."
    },
    {
      "number": "99-104",
      "title": "Carnegie Skills Workshop",
      "units": "3",
      "dependencies": "",
      "category": "CCM",
      "url": "",
      "visible": "TRUE",
      "semester": "F1",
      "description": "Carnegie Skills Workshop (CSW) is a 3-unit course that helps students to define, locate, evaluate, organize and present information.  CSW focuses on essential tools and technologies necessary for the successful completion of research and writing projects assigned in other courses.  The same skills are indispensable at any stage in a person's professional career and personal life.  All undergraduate students at CMU-Qatar are required to take the CSW course.  Incoming students are expected to take CSW during the fall semester."
    },
    {
      "number": "15-122",
      "title": "Fundamentals of Programming",
      "units": "10",
      "dependencies": "15-112",
      "category": "Core",
      "url": "http://www.qatar.cmu.edu/~srazak/courses/15122-s13/",
      "visible": "TRUE",
      "semester": "S1",
      "description": "For students with a basic understanding of programming (variables, expressions, loops, arrays, functions). Teaches imperative programming and methods for ensuring the correctness of programs. Students will learn the process and concepts needed to go from high-level descriptions of algorithms to correct imperative implementations, with specific application to basic data structures and algorithms. Much of the course will be conducted in a subset of C amenable to verification, with a transition to full C near the end. This course prepares students for 15-213 and 15-210."
    },
    {
      "number": "15-251",
      "title": "Great Theoretical Ideas in Computer Science",
      "units": "12",
      "dependencies": "15-112,21-127",
      "category": "Core",
      "url": "",
      "visible": "TRUE",
      "semester": "S1",
      "description": "This course is about how to use theoretical ideas to formulate and solve problems in computer science. It integrates mathematical material with general problem solving techniques and computer science applications. Examples are drawn from Algorithms, Complexity Theory, Game Theory, Probability Theory, Graph Theory, Automata Theory, Algebra, Cryptography, and Combinatorics. Assignments involve both mathematical proofs and programming."
    },
    {
      "number": "21-122",
      "title": "Integration and Approximation",
      "units": "10",
      "dependencies": "21-120",
      "category": "Math",
      "url": "",
      "visible": "TRUE",
      "semester": "S1",
      "description": "Integration by trigonometric substitution and partial fractions; arclength; improper integrals; Simpson's and Trapezoidal Rules for numerical integration; separable differential equations, Newton's method, Euler's method, Taylor's Theorem including a discussion of the remainder, sequences, series, power series. Parametric curves, polar coordinates, vectors, dot product."
    },
    {
      "number": "76-101",
      "title": "Interpretation and Argument",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "TRUE",
      "semester": "S1",
      "description": "Interpretation and Argument is a research-based course that assumes reading and writing are inseparable practices for responsible academic authoring. It introduces students to a systematic, inductive process for writing an argument from sources. In the course, students are exposed to a variety of different texts (mostly academic essays), so that they can explore and critically evaluate a single issue from multiple perspectives to eventually contribute an argument of their own. Students present their final contribution arguments in both oral and written forms.\nStudents learn that it takes time to plan, write, and critically revise their own texts. They also learn that the concept of audience is key for understanding communication tasks. For Interpretation and Argument, the rhetorical needs of an academic audience are emphasized for planning and writing effective arguments. Ultimately, the course provides opportunities for students to develop critical thinking skills and strategic methods for analyzing and producing texts within the context of an academic community."
    },
    {
      "number": "15-150",
      "title": "Principles of Functional Programming",
      "units": "10",
      "dependencies": "15-112,21-127",
      "category": "Core",
      "url": "http://www.qatar.cmu.edu/cs/15150/",
      "visible": "TRUE",
      "semester": "F2",
      "description": "The purpose of this course is to introduce the theory and practice of functional programming (FP). The characteristic feature of FP is the emphasis on computing by calculation. The traditional distinction between program and data characteristic of imperative programming (IP) is replaced by an emphasis on classifying expressions by types that specify their behavior. Types include familiar (fixed and arbitrary precision) numeric types, tuples and records (structs), classified values (objects), inductive types such as trees, functions with specified inputs and outputs, and commands such as input and output. Execution of imperative programs is generalized to evaluation of well-typed expressions by a smooth extension of mathematical experience to programming practice."
    },
    {
      "number": "15-213",
      "title": "Introduction to Computer Systems",
      "units": "12",
      "dependencies": "15-122",
      "category": "Core",
      "url": "http://www.qatar.cmu.edu/~msakr/15213-f08/",
      "visible": "TRUE",
      "semester": "F2",
      "description": "This course provides a programmer's view of how computer systems execute programs, store information, and communicate. It enables students to become more effective programmers, especially in dealing with issues of performance, portability and robustness. It also serves as a foundation for courses on compilers, networks, operating systems, and computer architecture, where a deeper understanding of systems-level issues is required. Topics covered include: machine-level code and its generation by optimizing compilers, performance evaluation and optimization, computer arithmetic, memory organization and management, networking technology and protocols, and supporting concurrent computation."
    },
    {
      "number": "21-241",
      "title": "Matrices and Linear Transformations",
      "units": "10",
      "dependencies": "21-127",
      "category": "Math",
      "url": "",
      "visible": "TRUE",
      "semester": "F2",
      "description": "A first course in linear algebra intended for scientists, engineers, mathematicians and computer scientists.  Students will be required to write some straightforward proofs.  Topics to be covered: complex numbers, real and complex vectors and matrices, rowspace and columnspace of a matrix, rank and nullity, solving linear systems by row reduction of a matrix, inverse matrices and determinants, change of basis, linear transformations, inner product of vectors, orthonormal bases and the Gram-Schmidt process, eigenvectors and eigenvalues, diagonalization of a matrix, symmetric and orthogonal matrices."
    },
    {
      "number": "15-221",
      "title": "Technical Communication for Computer Scientists",
      "units": "9",
      "dependencies": "76-101",
      "category": "Core",
      "url": "http://www.qatar.cmu.edu/cs/15221/",
      "visible": "TRUE",
      "semester": "S2",
      "description": "The course is designed for Computer Science majors (sophomores or higher) to improve their applied communication skills (written, visual and oral). It aims to help students learn how to read and analyze technical CS texts as well as design and present technical Computer-Science related documents for professional or lay audiences. Assignments include technical definitions, instructions, summaries, genre analyses, and proposals, and may incorporate recent computer science research at Carnegie Mellon, projects in related technical courses, and/or professional client-based projects. Working through textbook explanations and examples, analysis of sample texts, and the examination of common forms of workplace and academic communication, students will be able to focus on producing effective technical communication artifacts for their discipline."
    },
    {
      "number": "15-210",
      "title": "Parallel and Sequential Data Structures and Algorithms",
      "units": "12",
      "dependencies": "15-122,15-150",
      "category": "Core",
      "url": "",
      "visible": "TRUE",
      "semester": "S2",
      "description": "This course aims to teach methods for designing, analyzing, and programming sequential and parallel algorithms and data structures. The emphasis is on teaching fundamental concepts applicable across a wide variety of problem domains, and transferable across a reasonably broad set of programming languages and computer architectures. The course, however, includes a significant programming component in which students will program concrete examples from domains such as engineering, scientific computing, graphics, data mining, and information retrieval (web search). Unlike a traditional introduction to algorithms and data structures, this course puts an emphasis on parallel thinking—i.e., thinking about how algorithms can do multiple things at once instead of one at a time. The course follows up on material learned in 15-122 and 15-150 but goes into significant more depth on algorithmic issues."
    },
    {
      "number": "36-217",
      "title": "Probability Theory and Random Processes",
      "units": "9",
      "dependencies": "21-122",
      "category": "Math",
      "url": "",
      "visible": "TRUE",
      "semester": "S2",
      "description": "This course provides an introduction to probability theory.  It is designed for students in electrical and computer engineering.  Topics include elementary probability theory, conditional probability and independence, random variables, distribution functions, joint and conditional distributions, limit theorems, and an introduction to random processes.  Some elementary ideas in spectral analysis and information theory will be given.  The use of a computer package will be an integral part of this course."
    },
    {
      "number": "15-451",
      "title": "Algorithm Design and Analysis",
      "units": "12",
      "dependencies": "15-210,15-251,21-241",
      "category": "Core",
      "url": "",
      "visible": "TRUE",
      "semester": "F3",
      "description": "This course is about designing algorithms for computational problems, and how to think clearly about analyzing correctness and running time. The main goal of this course is to provide the intellectual tools needed for designing and analyzing your own algorithms for new problems you need to solve in the future. Algorithm design tools we will discuss include Dynamic Programming, Divide-and-Conquer, Data Structure design principles, Randomization, Network Flows, Linear Programming, and the Fast Fourier Transform. Some analytical tools we will discuss and use include Recurrences, Probabilistic Analysis, Amortized Analysis, and Potential Functions. We will also discuss a bit of Complexity Theory (which looks at the intrinsic difficulty of computational problems) as well as Cryptography and Algorithmic Game Theory."
    },
    {
      "number": "15-354",
      "title": "Computational Discrete Mathematics",
      "units": "12",
      "dependencies": "15-251",
      "category": "Algorithms",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is about the computational aspects of some of the standard concepts of discrete mathematics (relations, functions, logic, graphs, algebra, automata), with emphasis on efficient algorithms. We begin with a brief introduction to computability and computational complexity. Other topics include: iteration, orbits and fixed points, order and equivalence relations, propositional logic and satisfiability testing, finite fields and shift register sequences, finite state machines, and cellular automata. Computational support for some of the material is available in the form of a Mathematica package."
    },
    {
      "number": "15-355",
      "title": "Modern Computer Algebra",
      "units": "9",
      "dependencies": "15-251",
      "category": "Algorithms",
      "url": "",
      "visible": "FALSE",
      "semester": "http://www.andrew.cmu.edu/course/15-355/",
      "description": "The goal of this course is to investigate the relationship between algebra and computation. The course is designed to expose students to algorithms used for symbolic computation, as well as to the concepts from modern algebra which are applied to the development of these algorithms. This course provides a hands-on introduction to many of the most important ideas used in symbolic mathematical computation, which involves solving system of polynomial equations (via Groebner bases), analytic integration, and solving linear difference equations. Throughout the course the computer algebra system Mathematica will be used for computation."
    },
    {
      "number": "15-453",
      "title": "Formal Languages, Automata, and Computability",
      "units": "9",
      "dependencies": "15-251",
      "category": "Algorithms",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course provides an introduction to the fundamental ideas and models underlying computing: finite automata, regular sets, pushdown automata, context-free grammars, Turing machines, undecidability, and complexity theory."
    },
    {
      "number": "15-455",
      "title": "Undergraduate Complexity Theory",
      "units": "9",
      "dependencies": "15-251",
      "category": "Algorithms",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Complexity theory is the study of how much of a resource (such as time, space, parallelism, or randomness) is required to perform some of the computations that interest us the most. In a standard algorithms course, one concentrates on giving resource efficient methods to solve interesting problems. In this course, we concentrate on techniques that prove or suggest that there are no efficient methods to solve many important problems. We will develop the theory of various complexity classes, such as P, NP, co-NP, PH, #P, PSPACE, NC, AC, L, NL, UP, RP, BPP, IP, and PCP. We will study techniques to classify problems according to our available taxonomy. By developing a subtle pattern of reductions between classes we will suggest an (as yet unproven!) picture of how by using limited amounts of various resources, we limit our computational power."
    },
    {
      "number": "15-456",
      "title": "Computational Geometry",
      "units": "9",
      "dependencies": "15-451",
      "category": "Algorithms",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "How do you sort points in space? What does it even mean? This course takes the ideas of a traditional algorithms course, sorting, searching, selecting, graphs, and optimization, and extends them to problems on geometric inputs. We will cover many classical geometric constructions and novel algorithmic methods. Some of the topics to be covered are convex hulls, Delaunay triangulations, graph drawing, point location, geometric medians, polytopes, configuration spaces, linear programming, and others. This course is a natural extension to 15-451, for those who want to learn about algorithmic problems in higher dimensions."
    },
    {
      "number": "21-301",
      "title": "Combinatorics",
      "units": "9",
      "dependencies": "15-251,21-122",
      "category": "Algorithms",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "A major part of the course concentrates on algebraic methods, which are relevant in the study of error correcting codes, and other areas. Topics covered in depth include permutations and combinations, generating functions, recurrence relations, the principle of inclusion and exclusion, and the Fibonacci sequence and the harmonic series. Additional topics may include existence proofs, partitions, finite calculus, generating combinatorial objects, Polya theory, codes, probabilistic methods."
    },
    {
      "number": "21-484",
      "title": "Graph Theory",
      "units": "9",
      "dependencies": "15-251,21-241",
      "category": "Algorithms",
      "url": "http://www.qatar.cmu.edu/~yonina/21484",
      "visible": "FALSE",
      "semester": "",
      "description": "Graph theory uses basic concepts to approach a diversity of problems and nontrivial applications in operations research, computer science and other disciplines. It is one of the very few mathematical areas where one is always close to interesting unsolved problems. Topics include graphs and subgraphs, trees, connectivity, Euler tours and Hamilton cycles, matchings, graph colorings, planar graphs and Euler's Formula, directed graphs, network flows, counting arguments, and graph algorithms."
    },
    {
      "number": "02-450",
      "title": "Automation of Biological Research",
      "units": "9",
      "dependencies": "15-122",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Biology has become a \"big data\" science, as biomedical research has been revolutionized by automated methods for generating large amounts of data on diverse biological processes. Integration of data from many types of experiments is required to construct detailed, predictive models of cell, tissue or organism behaviors, and the complexity of the systems suggests that need for these models to be constructed automatically. This requires iterative cycles of acquisition, analysis, modeling, and experimental design, since it is not feasible to do all possible biological experiments. This course will cover a range of automated biological research methods (especially high-throughput, high-content, and robotic methods for gene sequencing, cell-based drug screening, and nanoassays), and a range of computational methods for automating the acquisition and interpretation of the data (especially active learning, proactive learning, compressed sensing and model structure learning). It assumes a basic knowledge of machine learning. Class sessions will consist of a combination of lectures and discussions of important research papers. Grading will be based on class participation, homeworks, and a final project."
    },
    {
      "number": "02-510",
      "title": "Computational Genomics",
      "units": "12",
      "dependencies": "",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Dramatic advances in experimental technology and computational analysis are fundamentally transforming the basic nature and goal of biological research. The emergence of new frontiers in biology, such as evolutionary genomics and systems biology is demanding new methodologies that can confront quantitative issues of substantial computational and mathematical sophistication. In this course we will discuss classical approaches and latest methodological advances in the context of the following biological problems: 1) Computational genomics, focusing on gene finding, motifs detection and sequence evolution.2) Analysis of high throughput biological data, such as gene expression data, focusing on issues ranging from data acquisition to pattern recognition and classification. 3) Molecular and regulatory evolution, focusing on phylogene tic inference and regulatory network evolution, and 4) Systems biology, concerning how to combine sequence, expression and other biological data sources to infer the structure and function of different systems in the cell. From the computational side this course focuses on modern machine learning methodologies for computational problems in molecular biology and genetics, including probabilistic modeling, inference and learning algorithms, pattern recognition, data integration, time series analysis, active learning, etc."
    },
    {
      "number": "05-431",
      "title": "Software Structures for User Interfaces",
      "units": "6",
      "dependencies": "",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is intended for those with advanced programming skills who want to do serious development of graphical user interfaces. This course includes: an introduction to task analysis and functional design of the user interface; basic principles of computer graphics used in UI implementation; event handling and event dispatching models; screen update algorithms and multi-view architectures; input syntax formalisms and their transformation into programs; interactive geometry; architectures for advanced features such as cut/copy/paste, macros and groupware. The course is intended for computer science majors. In some cases, the student and the Program Director will jointly determine the choice of 05-430 or 05-431, based upon the student’s previous programming experience."
    },
    {
      "number": "05-391",
      "title": "Designing Human Centered Software",
      "units": "12",
      "dependencies": "",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "http://www.hcii.cmu.edu/courses/designing-human-centered-software",
      "description": "Why are things so hard to use these days? Why doesn’t this thing I just bought work? Why is this web site so hard to use? These are frustrations that we have all faced from systems not designed with people in mind. The question this course will focus on is: how can we design human-centered systems that people find useful and usable? This course is an introduction to designing, prototyping, and evaluating user interfaces. If you take only one course in Human-Computer Interaction, this is the course for you. This class is open to all undergrads and grad students, with either technical or non-technical backgrounds. We will cover theory as well as practical application of ideas from Human-Computer Interaction. Course work includes lectures, class discussion, homework, class presentations, and group project."
    },
    {
      "number": "10-601",
      "title": "Machine Learning",
      "units": "12",
      "dependencies": "15-122,21-127",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "http://curtis.ml.cmu.edu/w/courses/index.php/Machine_Learning_10-601_in_Fall_2014",
      "description": "Machine Learning (ML) attempts to design programs that automatically improve their performance through experience. This includes learning many types of tasks based on many types of experience, e.g. spotting high-risk medical patients, recognizing speech, classifying text documents, detecting credit card fraud, or driving autonomous vehicles. 10601 covers all or most of: concept learning, version spaces, decision trees, neural networks, computational learning theory, active learning, estimation & the bias-variance tradeoff, hypothesis testing, Bayesian learning, the MDL principle, the Gibbs classifier, Naive Bayes, Bayes Nets & Graphical Models, the EM algorithm, Hidden Markov Models, K-Nearest-Neighbors and nonparametric learning, reinforcement learning, genetic algorithms, bagging, boosting and discriminative training. Grading will be based on weekly or biweekly assignments (written and/or programming), a midterm, a final exam, and possibly a project (details may vary depending on the section). 10601 is recommended for CS Seniors & Juniors, quantitative Masters students, & non-MLD PhD students. Prerequisites (strictly enforced): strong quantitative aptitude, college prob&stats course, and programming proficiency. For learning to apply ML practically & effectively, without the above prerequisites, consider 11344/05834 instead. You can evaluate your ability to take the course via a self-assessment exam at: http://www.cs.cmu.edu/~aarti/Class/10701_Spring14/Intro_ML_Self_Evaluation.pdf For section-specific information, see: Section 10601B: http://curtis.ml.cmu.edu/w/courses/index.php/Machine_Learning_10-601_in_Fall_2014"
    },
    {
      "number": "11-411",
      "title": "Natural Language Processing",
      "units": "12",
      "dependencies": "15-122",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will introduce students to the highly interdisciplinary area of Artificial Intelligence known alternately as Natural Language Processing (NLP) and Computational Linguistics. The course aims to cover the techniques used today in software that does useful things with text in human languages like English and Chinese. Applications of NLP include automatic translation between languages, extraction and summarization of information in documents, question answering and dialog systems, and conversational agents. This course will focus on core representations and algorithms, with some time spent on real-world applications. Because modern NLP relies so heavily on Machine Learning, we'll cover the basics of discrete classification and probabilistic modeling as we go. Good computational linguists also know about Linguistics, so topics in linguistics (phonology, morphology, and syntax) will be covered when fitting. From a software engineering perspective, there will be an emphasis on rapid prototyping, a useful skill in many other areas of Computer Science. In particular, we will introduce some high-level languages (e.g., regular expressions and Dyna) and some scripting languages (e.g., Python and Perl) that can greatly simplify prototype implementation."
    },
    {
      "number": "15-313",
      "title": "Foundations of Software Engineering",
      "units": "12",
      "dependencies": "15-214",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Students gain exposure to the fundamentals of modern software engineering. This includes both core CS technical knowledge and the means by which this knowledge can be applied in the practical engineering of complex software. Topics related to software artifacts include design models, patterns, coding, static and dynamic analysis, testing and inspection, measurement, and software architecture and frameworks. Topics related to software process include modeling, requirements engineering, process models and evaluation, team development, and supply chain issues including outsourcing and open source. This course has a strong technical focus, and will include both written and programming assignments. Students will get experience with modern software engineering tools."
    },
    {
      "number": "15-322",
      "title": "Introduction to Computer Music",
      "units": "9",
      "dependencies": "15-112",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Computers are used to synthesize sound, process signals, and compose music. Personal computers have replaced studios full of sound recording and processing equipment, completing a revolution that began with recording and electronics. In this course, students will learn the fundamentals of digital audio, basic sound synthesis algorithms, and techniques for digital audio effects and processing. Students will apply their knowledge in programming assignments using a very high-level programming language for sound synthesis and composition. In a final project, students will demonstrate their mastery of tools and techniques through music composition or by the implementation of a significant sound-processing technique."
    },
    {
      "number": "15-323",
      "title": "Computer Music Systems and Information Processing",
      "units": "9",
      "dependencies": "15-122",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course presents concepts and techniques for representing and manipulating discrete music information, both in real time and off line. Representations of music as explicitly timed event sequences will be introduced, and students will learn how to build efficient run-time systems for event scheduling, tempo control, and interactive processing. The MIDI protocol is used to capture real-time performance information and to generate sound. The course will also cover non-real-time processing of music data, including Markov models, style recognition, computer accompaniment, query-by-humming, and algorithmic composition. This course is independent of, and complementary to 15-322, Introduction to Computer Music, which focuses on sound synthesis and signal processing."
    },
    {
      "number": "15-381",
      "title": "Artificial Intelligence: Representation and Problem Solving",
      "units": "9",
      "dependencies": "15-122",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is about the theory and practice of Artificial Intelligence. We will study modern techniques for computers to represent task-relevant information and make intelligent (i.e. satisficing or optimal) decisions towards the achievement of goals. The search and problem solving methods are applicable throughout a large range of industrial, civil, medical, financial, robotic, and information systems. We will investigate questions about AI systems such as: how to represent knowledge, how to effectively generate appropriate sequences of actions and how to search among alternatives to find optimal or near-optimal solutions. We will also explore how to deal with uncertainty in the world, how to learn from experience, and how to learn decision rules from data. We expect that by the end of the course students will have a thorough understanding of the algorithmic foundations of AI, how probability and AI are closely interrelated, and how automated agents learn. We also expect students to acquire a strong appreciation of the big-picture aspects of developing fully autonomous intelligent agents. Other lectures will introduce additional aspects of AI, including natural language processing, web-based search engines, industrial applications, autonomous robotics, and economic/game-theoretic decision making."
    },
    {
      "number": "15-415",
      "title": "Database Applications",
      "units": "12",
      "dependencies": "15-210",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course covers the fundamental topics for Database Management Systems: Database System Architectural Principles (ACID properties; data abstraction; external, conceptual, and internal schemata; data independence; data definition and data manipulation languages), Data models (entity-relationship and relational data models; data structures, integrity constraints, and operations for each data model; relational query languages: SQL, algebra, calculus), Theory of database design (functional dependencies; normal forms; dependency preservation; information loss), Query Optimization (equivalence of expressions, algebraic manipulation; optimization of selections and joins), Storage Strategies (indices, B-trees, hashing), Query Processing (execution of sort, join, and aggregation operators), and Transaction Processing (recovery and concurrency control)."
    },
    {
      "number": "15-462",
      "title": "Computer Graphics",
      "units": "12",
      "dependencies": "15-213,21-241,21-259",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course provides a comprehensive introduction to computer graphics modeling, animation, and rendering. Topics covered include basic image processing, geometric transformations, geometric modeling of curves and surfaces, animation, 3-D viewing, visibility algorithms, shading, and ray tracing."
    },
    {
      "number": "16-384",
      "title": "Robot Kinematics and Dynamics",
      "units": "12",
      "dependencies": "15-122",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Foundations and principles of robotic kinematics. Topics include transformations, forward kinematics, inverse kinematics, differential kinematics (Jacobians), manipulability, and basic equations of motion. Course also include programming on robot arms."
    },
    {
      "number": "16-385",
      "title": "Computer Vision",
      "units": "9",
      "dependencies": "15-122,21-241",
      "category": "Applications",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Basic concepts in machine vision, including sensing and perception, 2D image analysis, pattern classification, physics-based vision, stereo and motion, and object recognition."
    },
    {
      "number": "15-312",
      "title": "Foundations of Programming Languages",
      "units": "12",
      "dependencies": "15-210,15-251",
      "category": "Logics",
      "url": "http://qatar.cmu.edu/cs/15312",
      "visible": "FALSE",
      "semester": "",
      "description": "This course has the purpose of exposing students who have mastered advanced programming techniques and concepts to some of the foundational principles that underly the very programming languages they have been using. These same principles pervade many disciplines in and beyond Computer Science and can be found any time one needs to give and work with a representation of some domain. Specifically, students see that a (good) programing language is a mathematical object whose external features (including expressiveness and usability) are the necessary manifestation of intrinsic properties. Students learn some of these general design principles, for example the use of types as an organizing principle, safety proofs as a measure of correctness, and the orthogonality of constructs, and study how they apply to the most common programming mechanisms, such as functions, records, variants and recursion, as well as to more specialized or esoteric concepts, such as polymorphism, exceptions, inheritance and concurrency. These same principles can be used to derive efficient and correct implementations techniques for a language, whose correctness can be established mathematically."
    },
    {
      "number": "15-317",
      "title": "Constructive Logic",
      "units": "9",
      "dependencies": "15-150",
      "category": "Logics",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This multidisciplinary junior/senior-level course is designed to provide a thorough introduction to modern constructive logic, its roots in philosophy, its numerous applications in computer science, and its mathematical properties. Some of the topics to be covered are intuitionistic logic, inductive definitions, functional programming, type theory, connections between classical and constructive logic, logic programming, linear logic, lax logic."
    },
    {
      "number": "15-414",
      "title": "Bug Catching: Automated Program Verification and Testing",
      "units": "9",
      "dependencies": "15-122,15-251",
      "category": "Logics",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Many CS and ECE students will be developing software and hardware that must be ultra reliable at some point in their careers. Logical errors in such designs can be costly, even life threatening. There have already been a number of well publicized errors like the Intel Pentium floating point error and the Arian 5 crash. In this course we will study tools for finding and preventing logical errors. Three types of tools will be studied: automated theorem proving, state exploration techniques like model checking and tools based on static program analysis. Although students will learn the theoretical basis for such tools, the emphasis will be on actually using them on real examples. This course can be used to satisfy the Logic & Languages requirement for the Computer Science major."
    },
    {
      "number": "15-424",
      "title": "Foundations of Cyber-Physical Systems",
      "units": "12",
      "dependencies": "15-122,21-122,15-251",
      "category": "Logics",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Cyber-physical systems (CPSs) combine cyber effects (computation and/or communication) with physical effects (motion or other physical processes). Designing algorithms to control CPSs, such as those in cars, aircraft and robots, is challenging due to their tight coupling with physical behavior. At the same time, it is vital that these algorithms be correct, since we rely on CPSs for safety-critical tasks like keeping aircraft from colliding. Students in this course will understand the core principles behind CPSs, develop models and controls, identify safety specifications and critical properties of CPSs, understand abstraction and system architectures, learn how to design by invariant, reason rigorously about CPS models, verify CPS models of appropriate scale, understand the semantics of a CPS model and develop an intuition for operational effects. Students will write hybrid programs (HPs), which capture relevant dynamical aspects of CPSs in a simple programming language with a simple semantics, allowing the programmer to refer to real-valued variables representing real quantities and specify their dynamics as part of the HP."
    },
    {
      "number": "21-300",
      "title": "Basic Logic",
      "units": "9",
      "dependencies": "15-251",
      "category": "Logics",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Propositional and predicate logic: Syntax, proof theory and semantics up to completeness theorem, Lowenheim Skolem theorems, and applications of the compactness theorem."
    },
    {
      "number": "80-310",
      "title": "Formal Logic",
      "units": "9",
      "dependencies": "15-251",
      "category": "Logics",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Among the most significant developments in modern logic is the formal analysis of the notions of provability and logical consequence for the logic of relations and quantification, known as first-order logic. These notions are related by the soundness and completeness theorems: a logical formula is provable if and only if it is true under every interpretation. This course provides a formal specification of the syntax and semantics of first-order logic and then proves the soundness and completeness theorems. Other topics may include: basic model theory, intuitionistic, modal, and higher-order logics."
    },
    {
      "number": "80-311",
      "title": "Computability and Incompleteness",
      "units": "9",
      "dependencies": "15-251",
      "category": "Logics",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Undecidability & Incompleteness focuses on two central problems of mathematical logic: the undecidability of predicate logic (established by Church and Turing) and the incompleteness of formal theories (discovered by Gödel for theories that contain a modicum of set or number theory). The mathematical solutions of these problems involve a rigorous concept of computability or calculability that turned out to be fundamental for computer science, but also cognitive science.\\n \\nWe first discuss predicate logic and systematic ways of constructing proofs; that is followed by the formal development of elementary set theory. The concept of Turing machine computation is introduced and shown to be equivalent to the concept of recursive function. That provides the mathematical, methodologically adequate tools for establishing the results mentioned above.\\n\\nThe mathematical and computational notions and results are among the most significant contributions of logic, not just to the solution of internal logical questions and to the foundations of computer science, but also to (the beginnings of) a deeper understanding of the human mind and mental processes. In addition to the mathematical developments, we will discuss historical and philosophical aspects of the subject."
    },
    {
      "number": "15-410",
      "title": "Operating System Design and Implementation",
      "units": "12",
      "dependencies": "15-213",
      "category": "Systems",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Operating System Design and Implementation is a rigorous hands-on introduction to the principles and practice of operating systems. The core experience is writing a small Unix-inspired OS kernel, in C with some x86 assembly language, which runs on a PC hardware simulator (and on actual PC hardware if you wish). Work is done in two-person teams, and \"team programming\" skills (source control, modularity, documentation) are emphasized. The size and scope of the programming assignments typically result in students significantly developing their design, implementation, and debugging abilities. Core concepts include the process model, virtual memory, threads, synchronization, and deadlock; the course also surveys higher-level OS topics including file systems, interprocess communication, networking, and security. Students, especially graduate students, who have not satisfied the prerequisite at Carnegie Mellon are strongly cautioned - to enter the class you must be able to write a storage allocator in C, use a debugger, understand 2's-complement arithmetic, and translate between C and x86 assembly language. The instructor may require you to complete a skills assessment exercise before the first week of the semester in order to remain registered in the class. Auditing: this course is usually full, and we generally receive many more requests to audit than we can accept. If you wish to audit, please have your advisor contact us before the semester begins to discuss your educational goals."
    },
    {
      "number": "15-411",
      "title": "Compiler Design",
      "units": "12",
      "dependencies": "15-213",
      "category": "Systems",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course covers the design and implementation of compiler and runtime systems for high-level languages, and examines the interaction between language design, compiler design, and runtime organization. Topics covered include lexical and syntactic analysis, handling of user-defined types and type-checking, context analysis, code generation and optimization, and memory management and runtime organization."
    },
    {
      "number": "15-418",
      "title": "Parallel Computer Architecture and Programming",
      "units": "12",
      "dependencies": "15-213",
      "category": "Systems",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The fundamental principles and engineering tradeoffs involved in designing modern parallel computers, as well as the programming techniques to effectively utilize these machines. Topics include naming shared data, synchronizing threads, and the latency and bandwidth associated with communication. Case studies on shared-memory, message-passing, data-parallel and dataflow machines will be used to illustrate these techniques and tradeoffs. Programming assignments will be performed on one or more commercial multiprocessors, and there will be a significant course project."
    },
    {
      "number": "15-440",
      "title": "Distributed Systems",
      "units": "12",
      "dependencies": "15-213",
      "category": "Systems",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The goals of this course are twofold: First, for students to gain an understanding of the principles and techniques behind the design of distributed systems, such as locking, concurrency, scheduling, and communication across the network. Second, for students to gain practical experience designing, implementing, and debugging real distributed systems. The major themes this course will teach include scarcity, scheduling, concurrency and concurrent programming, naming, abstraction and modularity, imperfect communication and other types of failure, protection from accidental and malicious harm, optimism, and the use of instrumentation and monitoring and debugging tools in problem solving. As the creation and management of software systems is a fundamental goal of any undergraduate systems course, students will design, implement, and debug large programming projects. As a consequence, competency in both the C and Java programming languages is required."
    },
    {
      "number": "15-441",
      "title": "Computer Networks",
      "units": "12",
      "dependencies": "15-213",
      "category": "Systems",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The emphasis in this course will be on the basic performance and engineering trade-offs in the design and implementation of computer networks. To make the issues more concrete, the class includes several multi-week projects requiring significant design and implementation. The goal is for students to learn not only what computer networks are and how they work today, but also why they are designed the way they are and how they are likely to evolve in the future. We will draw examples primarily from the Internet. Topics to be covered include: network architecture, routing, congestion/flow/error control, naming and addressing, peer-to-peer and the web, internetworking, and network security."
    },
    {
      "number": "21-242",
      "title": "Matrix Theory",
      "units": "10",
      "dependencies": "",
      "category": "Math",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "An honors version of 21-241 (Matrix Algebra and Linear Transformations) for students of greater aptitude and motivation. More emphasis will be placed on writing proofs. Topics to be covered: complex numbers, real and complex vectors and matrices, rowspace and columnspace of a matrix, rank and nullity, solving linear systems by row reduction of a matrix, inverse matrices and determinants, change of basis, linear transformations, inner product of vectors, orthonormal bases and the Gram-Schmidt process, eigenvectors and eigenvalues, diagonalization of a matrix, symmetric and orthogonal matrices, hermitian and unitary matrices, quadratic forms. 3 hrs. lec., 1 hr. rec."
    },
    {
      "number": "15-359",
      "title": "Probability and Computing",
      "units": "12",
      "dependencies": "15-251,21-241,21-259",
      "category": "Math",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Probability theory has become indispensable in computer science. In areas such as artificial intelligence and computer science theory, probabilistic methods and ideas based on randomization are central. In other areas such as networks and systems, probability is becoming an increasingly useful framework for handling uncertainty and modeling the patterns of data that occur in complex systems. This course gives an introduction to probability as it is used in computer science theory and practice, drawing on applications and current research developments as motivation and context. Topics include combinatorial probability and random graphs, heavy tail distributions, concentration inequalities, various randomized algorithms, sampling random variables and computer simulation, and Markov chains and their many applications, from Web search engines to models of network protocols. The course will assume familiarity with 3-D calculus and linear algebra."
    },
    {
      "number": "21-325",
      "title": "Probability",
      "units": "9",
      "dependencies": "21-259",
      "category": "Math",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course focuses on the understanding of basic concepts in probability theory and illustrates how these concepts can be applied to develop and analyze a variety of models arising in computational biology, finance, engineering and computer science. The firm grounding in the fundamentals is aimed at providing students the flexibility to build and analyze models from diverse applications as well as preparing the interested student for advanced work in these areas. The course will cover core concepts such as probability spaces, random variables, random vectors, multivariate densities, distributions, expectations, sampling and simulation; independence, conditioning, conditional distributions and expectations; limit theorems such as the strong law of large numbers and the central limit theorem; as well as additional topics such as large deviations, random walks and Markov chains, as time permits."
    },
    {
      "number": "36-225",
      "title": "Introduction to Probability Theory",
      "units": "9",
      "dependencies": "",
      "category": "Math",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is the first half of a year long course which provides an introduction to probability and mathematical statistics for students in economics, mathematics and statistics. The use of probability theory is illustrated with examples drawn from engineering, the sciences, and management. Topics include elementary probability theory, conditional probability and independence, random variables, distribution functions, joint and conditional distributions, law of large numbers, and the central limit theorem. A grade of C or better is required in order to advance to 36-226 and 36-410. Not open to students who have received credit for 36-217 or 36-625."
    },
    {
      "number": "02-261",
      "title": "Quantitative Cell and Molecular Biology Laboratory",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This is an introductory laboratory-based course designed to teach basic biological laboratory skills used in exploring the quantitative nature of biological systems and the reasoning required for performing research in computational biology. Over the course of the semester, students will perform many experiments and quantitatively analyze the results of these experiments. Students will also have the opportunity to design experiments based on the data they collect. During this course students will be using traditional, well-developed techniques to answer open questions. What microbes are found in the food we eat? What changes do cells undergo during apoptosis? Understanding the results of these experiments will require students to think critically about the results they generate, the appropriate controls required to confirm results, and the biological context within which these results were obtained. During this course students will gain experience in many aspects of scientific research, including: Sequencing and analyzing a large and diverse population of DNA, Designing and performing PCR for a variety of analyses, Maintaining cell cultures, Taking brightfield and fluorescent microscopy images, Developing methods for automated analysis of cell images, Communicating results to peers and colleagues."
    },
    {
      "number": "03-124",
      "title": "Modern Biology Laboratory",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This laboratory is designed to introduce students to modern concepts in the biological sciences. The experiments illustrate many of the principles covered in 03-121 and 03-230. Experimentation using living organisms and/or their tissues, cells or molecules is an essential component of this course."
    },
    {
      "number": "09-101",
      "title": "Introduction to Experimental Chemistry",
      "units": "3",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This is a seven week chemistry laboratory course that is designed to introduce students to some basic laboratory skills, techniques, and equipment commonly used in experimental chemical investigations. The experiments will apply concepts in organic synthesis, quantitative analysis using visible spectrophotometry, kinetics, acid-base chemistry, thermochemistry, transition metal chemistry, chromatography, and protein biochemistry."
    },
    {
      "number": "09-221",
      "title": "Laboratory I: Introduction to Chemical Analysis",
      "units": "12",
      "dependencies": "09-106",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is the first in a sequence of four laboratory courses on experimental aspects of chemistry required for the B.S. degree in chemistry. The experimental work emphasizes the techniques of quantitative chemical analysis. Included are projects dealing with a variety of instrumental and wet chemical techniques. The course is project-oriented with the experiments becoming more complex, requiring greater student input into the experimental design as the semester progresses. A mixture of individual and team experiments are conducted during the semester. In addition to techniques, safety, written and oral communication skills, and effective teamwork are emphasized."
    },
    {
      "number": "15-321",
      "title": "Research Methods for Experimental Computer Science",
      "units": "9",
      "dependencies": "15-213",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The success or failure of an experiment can turn on the details of how the experiment was performed — the experimental method. It is critical that the methodology be consistent with whatever research hypothesis is being pursued. The goal of this project-based course is to give students familiarity with and appreciation for the subtleties of a range of experimental techniques essential to high-quality empirical research. The course is based on a project that will illustrate important concepts of research methods. Example topics include user-study design and operation, data gathering, data diagnosis, experiment design and execution, signal detection, performance evaluation, error analysis, reporting results, etc. The project will explore the challenging open problem of keystroke dynamics, a biometric regime which seeks to identify/authenticate/discriminate users on the basis of their typing styles. In this context, numerous methodological issues provide the stimulus for learning how to perform empirical research from the beginning to the end of a project. Lectures will present necessary background material about the problem area and experimental methods; homework assignments and a team project will give students guided, hands-on, research and practical experience. At the end of the course, students will be acquainted with the basic issues in experimental methods, and will be able to perform independent work using the lessons learned and resources provided. Enrollment is limited to graduate students, juniors, and seniors. It will be helpful for students to have some experience with scripting languages (e.g., Perl, Python, Tcl, etc), statistically-oriented packages (e.g., R, Matlab, Weka) or other implementations of various machine-learning-type classifiers. This course can be used to satisfy the Lab requirement for the Computer Science major."
    },
    {
      "number": "27-100",
      "title": "Engineering the Materials of the Future",
      "units": "12",
      "dependencies": "21-120,33-106",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Materials form the foundation for all engineering applications. Advances in materials and their processing are driving all technologies, including the broad areas of nano-, bio-, energy, and electronic (information) technology. Performance requirements for future applications require that engineers continue to design both new structures and new processing methods in order to engineer materials having improved properties. Applications such as optical communication, tissue and bone replacement, fuel cells, and information storage, to name a few, exemplify areas where new materials are required to realize many of the envisioned future technologies. This course provides an introduction to how science and engineering can be exploited to design materials for many applications. The principles behind the design and exploitation of metals, ceramics, polymers, and composites are presented using examples from everyday life, as well as from existing, new, and future technologies. A series of laboratory experiments are used as a hands-on approach to illustrating modern practices used in the processing and characterization of materials and for understanding and improving materials' properties."
    },
    {
      "number": "33-104",
      "title": "Experimental Physics",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course provides first year students and sophomores with an introduction to the methods of experimental physics. Particular emphasis is placed on three aspects of experimentation: laboratory technique, including both the execution and the documentation of an experiment; data analysis, including the treatment of statistical and systematic errors and computer-aided analysis of experimental data; and written communication of experimental procedures and results. The concepts and skills for measurement and data analysis are acquired gradually through a series of experiments covering a range of topics from mechanics to nuclear and atomic physics."
    },
    {
      "number": "42-203",
      "title": "Biomedical Engineering Laboratory",
      "units": "9",
      "dependencies": "03-121,42-101",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This laboratory course is designed to provide students with the ability to make measurements on and interpret data from living systems. The experimental modules reinforce concepts from 42-101 Introduction to Biomedical Engineering and expose students to four areas of biomedical engineering: biomedical signal and image processing, biomaterials, biomechanics, and cellular and molecular biotechnology. Several cross-cutting modules are included as well. The course includes weekly lectures to complement the experimental component. Prerequisites: 42-101 Introduction to Biomedical Engineering and 03-121 Modern Biology. Pre-med students should register for 03-206. Priority for enrollment will be given to students who have declared the Additional Major in Biomedical Engineering."
    },
    {
      "number": "85-310",
      "title": "Research Methods in Cognitive Psychology",
      "units": "9",
      "dependencies": "85-211",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This is a course in which students develop the research skills associated with cognitive psychology and cognitive science. Students learn how to design and conduct experiments, and analyze and interpret the data they collect. The course covers a variety of experimental designs, e.g., factorial, Latin Squares. Analyses of response times, qualitative data, and signal detection are also covered. Cognitive modeling will also be discussed. Topics include mental imagery, memory, and perception. The class format consists of lectures, discussions and student presentations. You must have either taken 36-309 previously or 36-309 can be taken as co-req in Fall semester. In the Spring semester 36-309 is prereq."
    },
    {
      "number": "02-223",
      "title": "Personalized Medicine: Understanding Your Own Genome",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Do you want to know how to discover the tendencies hidden in your genome? Since the first draft of a human genome sequence became available about a decade ago, the cost of genome sequencing has decreased dramatically. Personal genome sequencing will likely become a routine part of medical exams for patients for prognostic and diagnostic purposes. Personal genome information will also play an increasing role in lifestyle choices, as people take into account their own genetic tendencies. Commercial services such as 23andMe have already taken first steps in this direction. Computational methods for mining large-scale genome data are being developed to unravel the genetic basis of diseases and assist doctors in clinics. This course introduces students to biological, computational, and ethical issues concerning use of personal genome information in health maintenance, medical practice, biomedical research, and policymaking. We focus on practical issues, using individual genome sequences (such as that of Nobel prize winner James Watson) and other population-level genome data. Without requiring any background in biology or CS, we begin with an overview of topics from genetics, molecular biology, stats, and machine learning relevant to the modern personal genome era. We then cover scientific issues such as how to discover your genetic ancestry and how to learn from genomes about migration and evolution of human populations. We discuss medical aspects such as how to predict whether you will develop diseases such as diabetes based on your own genome, how to discover disease-causing genetic mutations, and how genetic information can be used to recommend clinical treatments."
    },
    {
      "number": "02-250",
      "title": "Introduction to Computational Biology",
      "units": "12",
      "dependencies": "03-121",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This is a 12-unit class intended to provide a general introduction to computational tools for biology. The course is divided into two modules, which may be taken individually as courses 03-251/02-251 and 03-252/02-252. Module 1 covers computational molecular biology/genomics. It examines important sources of biological data, how they are archived and made available to researchers, and what computational tools are available to use them effectively in research. In the process, it covers basic concepts in statistics, mathematics, and computer science needed to effectively use these resources and understand their results. Specific topics covered include sequence data, searching and alignment, structural data, genome sequencing, genome analysis, genetic variation, gene and protein expression, and biological networks and pathways. Module 2 covers computational cell biology, including biological modeling and image analysis. It includes homeworks requiring use or modification of Matlab scripts. The modeling component includes computer models of population dynamics, biochemical kinetics, cell pathways, neuron behavior, and stochastic simulations. The imaging component includes basics of machine visions, morphological image analysis, image classification and image-derived models. This course is intended primarily for biological sciences or biomedical engineering majors at the undergraduate or graduate level who have had little or no prior experience with computer science or programming. Students may not take both 03-250/02-250 and either 03-251/02-251 or 03-252/02-252 for credit. Prerequisites: 03-121 or permission of the instructors"
    },
    {
      "number": "02-261",
      "title": "Quantitative Cell and Molecular Biology Laboratory",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This is an introductory laboratory-based course designed to teach basic biological laboratory skills used in exploring the quantitative nature of biological systems and the reasoning required for performing research in computational biology. Over the course of the semester, students will perform many experiments and quantitatively analyze the results of these experiments. Students will also have the opportunity to design experiments based on the data they collect. During this course students will be using traditional, well-developed techniques to answer open questions. What microbes are found in the food we eat? What changes do cells undergo during apoptosis? Understanding the results of these experiments will require students to think critically about the results they generate, the appropriate controls required to confirm results, and the biological context within which these results were obtained. During this course students will gain experience in many aspects of scientific research, including: Sequencing and analyzing a large and diverse population of DNA, Designing and performing PCR for a variety of analyses, Maintaining cell cultures, Taking brightfield and fluorescent microscopy images, Developing methods for automated analysis of cell images, Communicating results to peers and colleagues. As space is limited, laboratory sections will be small. Additional sections will be added to accommodate all students on the waitlist. Course Outline: (1) 3-hour lab per week (1) 2-hour lecture per week. "
    },
    {
      "number": "06-262",
      "title": "Mathematical Methods of Chemical Engineering",
      "units": "12",
      "dependencies": "06-100,06-221,21-122",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Mathematical techniques are presented as tools for modeling and solving engineering problems. Modeling of steady-state mass and energy balance problems using linear and matrix algebra, including Gaussian elimination, decomposition, and iterative techniques. Modeling of unsteady-state engineering problems using linear and nonlinear differential equations. Analytical techniques, including Laplace transforms, and numerical techniques for the solution of first-and higher-order differential equations and systems of differential equations arising in engineering models. Finally, the modeling of processes affected by chance and subject to experimental error; statistical and regression techniques within the context of experimental design and analysis of experimental data."
    },
    {
      "number": "09-103",
      "title": "Atoms, Molecules and Chemical Change",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This is a one-semester introductory college level course designed for non-science and engineering majors who have had a high school course in chemistry. Students with primary or additional majors in MCS, CIT or SCS will not be allowed to enroll. Chemistry topics will be introduced on an as needed basis in the contexts of air pollution, the ozone layer, global warming, acid rain, safe drinking water, alternative energy sources, plastics, and drug design. Students will apply concepts in topics such as the classification of matter, the relationship between matter and energy, atomic theory and the Periodic Table, chemical bonding, molecular shapes, molecular polarity, interparticle forces, chemical reactions, stoichiometry, properties of aqueous solutions, acid-base chemistry, redox chemistry, and organic chemistry. Students will gain an understanding of how chemistry impacts major environmental, social, political, and economic issues that we encounter daily. They will also learn to apply chemical concepts to new situations or contexts. Students with credit for 09-105 or more advanced chemistry courses will not be allowed to enroll in this course. 3 hrs. lec., 1 hr. rec."
    },
    {
      "number": "09-104",
      "title": "Fundamental Aspects of Organic Chemistry and Biochemistry",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course, which includes demonstrations and \"hands-on\" activities, is designed to engage non-majors in the fascination of chemistry. It is not essential that a student has completed 09-103 in order to take this course. The lecture part of this course will include wide ranging science topics designed to put the world of chemistry in perspective. After achieving a competency in fundamentals we proceed to systematically survey the important topics of synthesis, structure and mechanism in organic chemistry. With these insights we finally confront the important biological molecules including DNA. 3 hrs lec.,1 hr rec."
    },
    {
      "number": "09-231",
      "title": "Mathematical Methods for Chemists",
      "units": "9",
      "dependencies": "09-106,21-122",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course covers mathematical techniques that are important in the chemical sciences. The techniques will be covered in the context of chemical phenomena, and combine topics from 3-dimensional calculus, differential equations, linear algebra and statistics. This course does not count towards the minor in chemistry. 3 hrs. lec."
    },
    {
      "number": "18-090",
      "title": "Introduction to Signal Processing for Creative Practice",
      "units": "10",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Signals are the raw materials used in many forms of electronic art - video, electronic music, interactive art, kinetic sculpture, and more. In these fields, signals are used to represent information about sound, images, sensors, and movement. By transforming and manipulating these types of signals, we are able to create powerful new tools for digital art, multimedia design, music composition and performance, responsive environments, video and sound installation, mobile applications, and beyond. In this course we will study Signal Processing from a practical point-of-view, developing tools that can be easily integrated into art-making using the graphical programming environment Max (a.k.a. Max/MSP/Jitter). We will present a survey of Signal Processing techniques used in the sonic and visual arts, and will discuss the mathematical theories underlying these techniques. Students will be encouraged to combine, modify, and extend working examples of software to create original digital artworks. Course development by Richard Stern and Tom Sullivan."
    },
    {
      "number": "18-202",
      "title": "Mathematical Foundations of Electrical Engineering",
      "units": "12",
      "dependencies": "21-122",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course covers topics from engineering mathematics that serve as foundations for descriptions of electrical engineering devices and systems. It is the corequisite mathematics course for 18-220, Fundamentals of Electrical Engineering. The topics include: (1) MATLAB as a robust computational tool, used to reinforce, enrich and integrate ideas throughout the course, including software exercises and projects in combination with homework assignments, (2) Complex Analysis, including rectangular and polar representations in the complex plane with associated forms of complex arithmetic, powers, roots and complex logarithms, complex differentiation, analytic functions and Cauchy-Riemann equations, complex Taylor series, complex exponential, sinusoidal and hyperbolic functions, and Euler's formula, (3) Fourier Analysis, including orthogonality of sinusoids, trigonometric and exponential forms of Fourier series, Fourier integrals and Fourier transforms, (4) Linear, Constant-Coefficient Differential Equations, including complex exponential solutions to homogeneous equations and particular solutions with polynomial and sinusoidal driving functions described by phasors, (5) Difference Equations, with emphasis upon their relationship to differential equations, and (6) Linear Algebra and Matrices, including matrix arithmetic, linear systems of equations and Gaussian elimination, vector spaces and rank of matrices, matrix inverses and determinants, eigenvalue problems and their relationship to systems of homogeneous differential equations. 4 hrs. lec., 1hr. rec."
    },
    {
      "number": "18-345",
      "title": "Introduction to Telecommunication Networks",
      "units": "12",
      "dependencies": "36-217,18-213",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course introduces the fundamental concepts of telecommunication networks. Underlying engineering principles of telephone networks, computer networks and integrated digital networks are discussed. Topics in the course include: telephone and data networks overview; OSI layers; data link protocol; flow control, congestion control, routing; local area networks; transport layer; introduction to high-speed networks; performance evaluation techniques. The course also reviews important aspects of network security and widely used classes of Internet application and services, such as peer-to-peer, content delivery networks, and video streaming."
    },
    {
      "number": "18-411",
      "title": "Computational Techniques in Engineering",
      "units": "12",
      "dependencies": "15-100,21-120,21-122,21-259,21-260",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course develops the methods to formulate basic engineering problems in a way that makes them amenable to computational/numerical analysis. The course will consist of three main modules: basic programming skills, discretization of ordinary and partial differential equations, and numerical methods. These modules are followed by two modules taken from a larger list: Monte Carlo-based methods, molecular dynamics methods, image analysis methods, and so on. Students will learn how to work with numerical libraries and how to compile and execute scientific code written in Fortran-90 and C++. Students will be required to work on a course project in which aspects from at least two course modules must be integrated."
    },
    {
      "number": "18-487",
      "title": "Introduction to Computer & Network Security & Applied Cryptography",
      "units": "12",
      "dependencies": "15-214,18-213",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Security is becoming one of the core requirements in the design of critical systems. This course will introduce students to the intro-level fundamental knowledge of computer security and applied cryptography. Students will learn the basic concepts in computer security including software vulnerability analysis and defense, networking and wireless security, and applied cryptography. Students will also learn the fundamental methodology for how to design and analyze security critical systems."
    },
    {
      "number": "19-101",
      "title": "Introduction to Engineering and Public Policy",
      "units": "12",
      "dependencies": "21-120,21-121,33-106",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course examines the processes of public and private decision making and of policy formation, which shape the evolution of a technology and its impact on our society. Technology plays an important role in shaping our worlds. At the same time, social forces often play a central role in the evolution of a technology. A particular technology such as an automobile or computer is chosen to study technology and policy in context. Specific topics covered in the case of the automobile includes automotive design and manufacture, safety, pollution, fuel economy and their interactions. In each area, we discuss the technological and institutional issues, their interaction, the possible need for public policy and the factors that govern the policy. The course will involve several group problem-solving sessions."
    },
    {
      "number": "19-211",
      "title": "Ethics and Policy Issues in Computing",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Should autonomous robots make life and death decisions on their own? Should we allow them to select a target and launch weapons? To diagnose injuries and perform surgery when human doctors are not around? Who should be permitted to observe you, find out who your friends are, what you do and say with them, what you buy, and where you go? Do social media and personalized search restrict our intellectual horizons? Do we live in polarizing information bubbles, just hearing echoes of what we already know and believe? As computing technology becomes ever more pervasive and sophisticated, we are presented with an escalating barrage of decisions about who, how, when, and for what purposes technology should be used. This course will provide an intellectual framework for discussing these pressing issues of our time, as we shape the technologies that in turn shape us. We will seek insight through reading, discussion, guest lectures, and debates. Students will also undertake an analysis of a relevant issue of their choice, developing their own position, and acquiring the research skills needed to lend depth to their thinking. The course will enhance students' ability to think clearly about contentious technology choices, formulate smart positions, and support their views with winning arguments."
    },
    {
      "number": "19-350",
      "title": "SP TP: Research Methods & Statistics for Engineering & Public Policy Analysis",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course synthesizes concepts from economics, statistics, decision analysis, and other humanities and social science areas as they relate to analysis of technology and public policy issues. Students will focus on applying skills, tools, and techniques of social science to critically examine issues of current importance to society that have engineering systems at the core, and how public policy can be informed by the results of these analyses. Students will discover the relationship between formulating research questions considering a wide range of perspectives (e.g., political, ethical, social, economic, and legal aspects) and implementing the appropriate methods for answering them. The course will emphasize interpretation and communication of analysis results in written and oral presentation, especially to non-technical audiences. As a precursor to the EPP Project courses, the course also prepares EPP juniors for structuring real-world problems into a feasible work plan, and to deal with revising work plans as work proceeds."
    },
    {
      "number": "19-402",
      "title": "Telecommunications Technology, Policy & Management",
      "units": "12",
      "dependencies": "73-100",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course provides a comprehensive introduction to basic principles of telecommunications technology and the legal, economic, and regulatory environment of the telecommunications industry. Topics covered are: role of new technologies such as fiber, wireless, voice over packet, and broadband access; principles behind telecommunications regulation from common carrier law and natural monopoly to open access and interconnection; differences in the treatment of telecommunications versus information services. Also, mergers, antitrust, and the changing industrial structure of telecommunications; spectrum allocation and management; and international comparison of telecommunications regulations. Special emphasis on how the new technologies have altered and are altered by regulation."
    },
    {
      "number": "19-403",
      "title": "Policies of Wireless Systems and the Internet",
      "units": "12",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will address public policy issues related to wireless systems, and to the Internet. It begins by investigating policies related to a wide variety of emerging wireless systems and technologies, including wifi computer networks, broadband to the home, broadcast radio and television, and satellite communications. This can include the government role in facilitating the creation of infrastructure, in advancing competition among broadcasters and communications service providers, in managing spectrum, and in protecting privacy and security. The course will then address Internet policy issues, which can include Internet governance and the domain name system, taxation, privacy and security, and intellectual property. Because these are inherently interdisciplinary issues, the course will include detailed discussions of technology, economics, and law, with no prerequisites in any of these areas."
    },
    {
      "number": "19-411",
      "title": "Global Competitiveness: Firms, Nations and Technological Change",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Global Competitiveness introduces students to the fundamental principles surrounding global competitiveness and technological change in the 21st century. The course is broken into three sections. The first section introduces students to competing economic, sociological, and political science theories on the structures supporting technological change. The second section presents the contemporary literature on technological change. The concluding section leverages lessons from the preceding two sections to evaluate national innovation systems, and the factors that lead to national comparative advantage. Students should leave the class able to reflect competently on what the existing literature tells us about the factors influencing global technology competitiveness, and on how modern changes in the structures supporting innovation as well as technology itself may be changing the rules of the game for firms and for nations. The course is open to undergraduate juniors, seniors & graduate students."
    },
    {
      "number": "19-448",
      "title": "Science, Technology & Ethics",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Technology has always been a pervasive force in society. But the last century, and especially the last 50 years have seen an unprecedented acceleration of the growth and permeation of technology. The central role of technology and engineering in the modern world calls for a reflective examination of the responsibility of those who develop, deploy and spread technologies as well as those who avail of them for various purposes. This course will explore one technology of recent origin in detail –biotechnology. After examining the way people think about and deal with technological risk, the basic science behind the technology and the ethos of science and technology, the students will learn about the philosophical foundations of possible ethics for science and technology. Projects and discussions will explore how these foundations can be used to provide ways to frame important questions and develop an understanding of an ethic for the development and use of biotechnology."
    },
    {
      "number": "33-100",
      "title": "Basic Experimental Physics",
      "units": "6",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course provides students with a basic introduction to experimental physics. The content of the course and the particular experiments to be carried out are chosen to be especially useful for students who intend to work in the health sciences. Specific topics will range from mechanics to nuclear and atomic physics. This course is specifically geared toward pre-health students."
    },
    {
      "number": "33-115",
      "title": "Physics for Future Presidents",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Countless topics of social and political importance are intimately related to science in general and physics in particular. Examples include energy production, global warming, radioactivity, terrorism, and space travel. This course aims to provide key bits of knowledge based on which such issues can be discussed in a meaningful way, i.e., on the level of arguments and not just vague beliefs. We will cover an unusually wide range of topics, including energy, heat, gravity, atoms, radioactivity, chain reactions, electricity, magnetism, waves, light, weather, and climate. No calculus or algebra will be required. The course is open for all students at CMU."
    },
    {
      "number": "33-124",
      "title": "Introduction to Astronomy",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Astronomy continues to enjoy a golden age of exploration and discovery. This course presents a broad view of astronomy, straightforwardly descriptive and without any complex mathematics. The goal of the course is to encourage non-technical students to become scientifically literate and to appreciate new developments in the world of science, especially in the rapidly developing field of astronomy. Subjects covered include the solar system, stars, galaxies and the universe as a whole. The student should develop an appreciation of the ever-changing universe and our place within it. Computer laboratory exercises will be used to gain practical experience in astronomical techniques. In addition, small telescopes will be used to study the sky. This course is specifically geared toward non-science/engineering majors."
    },
    {
      "number": "33-232",
      "title": "Mathematical Methods of Physics",
      "units": "10",
      "dependencies": "33-231",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course introduces, in the context of physical systems, a variety of mathematical tools and techniques that will be needed for later courses in the physics curriculum. Topics will include, linear algebra, vector calculus with physical application, Fourier series and integrals, partial differential equations and boundary value problems. The techniques taught here are useful in more advanced courses such as Physical Mechanics, Electricity and Magnetism, and Advanced Quantum Physics."
    },
    {
      "number": "39-100",
      "title": "Special Topics: WHAT IS ENGINEERING?",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "What is Engineering? In today’s world, we are so used to technology, helping us yet giving rise to complex problems, our friend and yet sometimes our challenge in preserving all that is human. This course is an introduction to all students about what engineers do and how they do it. It is about the culture, the thinking, the creativity and more than anything else, the doing which is at the heart of engineering. On a more pragmatic level, our world of ever-increasing technological complexity demands that everyone is to some extent familiar with things technical. William A. Wulf, President of the National Academy of Engineering, has said that a public that is technologically less than literate and unable to understand technical decisions is left to trust that good decisions will be made on their behalf. We invite you to take this course to get a feeling for what engineers experience in their work and bring out the creativity in each of you. The goal of this course is to help Carnegie Mellon students of all disciplines understand the role and impact of engineering in modern society and participate in the excitement of engineering. Demonstrations and hands-on projects will give students the experience of what engineers do. After completing this course you will have a better understanding of the contributions of engineering to our society, how engineers see and think about the world, what the “big issues” for engineers are, what’s involved in the different fields of engineering, and the tools engineers use. The multi-disciplinary and collaborative nature of almost all engineering work will be stressed. 39-100 is open to first through third year students in all majors except engineering."
    },
    {
      "number": "39-200",
      "title": "Business for Engineers",
      "units": "9",
      "dependencies": "",
      "category": "Science",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is intended to prepare CIT graduates for the fast paced world of modern industry. There have been paradigm shifts that complicate career selection and compound the difficulty of becoming a productive member of an organization. Graduates of a technical program can benefit from an understanding of modern business concepts when they begin their careers. The content of this course will include both specific financial analysis topics and certain business administration topics such as program management, entrepreneurship and ethics. Students will become familiar with analyzing financial statements, stock market reports and stock options while developing their verbal and written presentation skills."
    },
    {
      "number": "70-311",
      "title": "Organizational Behavior",
      "units": "9",
      "dependencies": "76-101",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course examines the factors which influence individual, group and firm behavior in the context of the workplace. Topics covered include perception, group behavior, decision making, motivation, leadership and organizational design and change."
    },
    {
      "number": "80-130",
      "title": "Introduction to Ethics",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course provides both a historic and thematic survey of western ethical theory. Key figures such as Aristotle, Hobbes, Kant, Mill, and Nietzsche will be presented as background to the thematic problems of relativism, egoism, and other concepts in ethical theory. Students will take part in the creative process of developing skills necessary to engage in reflective moral reasoning. This process will culminate in the use of interactive multimedia modules simulating real world scenarios involving difficult moral choices. Participating in a class ethics committee will provide students with opportunities for personal reflection on the ways moral reasoning can be used to expand our understanding of hard choices and moral dilemmas."
    },
    {
      "number": "80-150",
      "title": "Nature of Reason",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course offers an intellectual history of philosophical views regarding the nature of human reasoning in mathematics and the sciences, from ancient to modern times. The first part of the course traces the search for deductive methods for obtaining certain knowledge, starting with Aristotle and Euclid, and continuing through the Middle Ages and late Renaissance thought, to the work of Boole and Frege in the nineteenth century. The second part of the course considers the history of skepticism about empirical knowledge, covering Plato, Sextus Empiricus, Descartes, Pascal, and Hume, along with replies to skepticism in the works of Bayes and Kant. The third part of the course discusses theories of the nature of mind, culminating in the computational conception of mind that underlies contemporary cognitive science."
    },
    {
      "number": "80-180",
      "title": "Nature of Language",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Language is used to talk about the world or to describe it, but how do we go about describing language itself? Linguistics is the name given to the science of language, whose task it is to give such a description. \\r\\nThe discipline of linguistics has developed novel tools for describing and analyzing language over the last two hundred years and in this course we learn what these tools are and practice applying them. \\r\\nSub-areas of linguistics which we study include phonetics (the study of speech sounds), phonology (the study of sound systems), morphology (the study of parts of words), and syntax (the study of combinations of words). Beyond this, we look at changes in language over time, and we consider the puzzle of linguistic meaning. The methods of linguistics are useful in the study of particular languages and in the study of language generally, so this course is useful for students of foreign languages as well as those interested in going on to study language acquisition, psycholinguistics, sociolinguistics, philosophy of language, and computer modeling of language."
    },
    {
      "number": "80-221",
      "title": "Philosophy of Social Science",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will explore various philosophical issues germane to social science. The central question of the course asks whether we can use traditional scientific tools to understand social phenomena, e.g.\\nwars and religions, in the same way that we use them to understand natural phenomena, e.g. gases, lasers and planetary orbits. Some of the more specific questions we address: Because humans possess free will and act with intentions while light rays and planets in motion do not, are we forced to use logically different species of explanations in the two cases? How can we explain social institutions that depend upon cooperation? Whereas natural scientists actively conduct experiments, social scientists can often only collect statistical data. Does this difference prevent social scientists from inferring causal relations? Is our understanding of social phenomena always value laden?"
    },
    {
      "number": "80-230",
      "title": "Ethical Theory",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Every day, even in very subtle ways, we make judgments of value that shape our lives and our conduct. This course will examine four influential attempts at providing a systematic account of the source and nature of moral value, its relationship to other kinds of value, and the practical implications of different answers to these questions. This focus on the fundamental structure of moral value will frequently engage topics such as the nature of the good, subjectivist and objectivist accounts of value, forms of moral naturalism verses attempts at moral constructivism, and will draw on historical as well as more contemporary\\r\\nsources. Particular attention will be paid to articulating the specific sources of disagreement that distinguish competing moral theories in order to facilitate our ability to adjudicate between them on a reasoned basis."
    },
    {
      "number": "80-241",
      "title": "Ethical Judgments in Professional Life",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This is a multimedia, hybrid course that examines the numerous ethical issues, problems and dilemmas that confront professionals in such areas as medicine, law, engineering, the media, government and the natural and social sciences. As a hybrid course, it includes educational materials in video streaming format, an audio CD, an electronic discussion board and web-based \\223guided inquiries\\224 that students navigate and complete. Topics discussed include: Responsibility in the professions, obligations to clients, conflicts of interest, Whistleblowing, codes of ethics and ethics in engineering, medicine, law, media, computer science and business among others. This course meets one day a week and employs a case study discussion format during class."
    },
    {
      "number": "80-270",
      "title": "Philosophy of Mind",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The mind poses one of the greatest challenges to understanding how the world works. What is a mind? What is consciousness? What is sensing? What is agency? How are these facets of subjectivity related to the objective, physical world? In this course, we tackle these challenging questions with a philosophical approach that highlights analysis and argument, though we will also bring in relevant empirical understanding of the mind and brain to enrich our discussion (a complementary course, Philosophy and Psychology, is taught in alternate years where the empirical issues are the focus with enrichment from philosophy). A central practical aim of this course is to promote development of analytical skills through practice engaging with arguments."
    },
    {
      "number": "80-271",
      "title": "Philosophy and Psychology",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course has two parts. First, we will look at basic concepts used in psychology (and cognitive science broadly) through the lens of philosophy including: representation, computation, information, explanation, modularity, attention, automaticity and control. Having some concrete proposals about these ideas will allow us to formulate psychological claims more concretely. Second, we will reverse course and look at traditional philosophical problems through the lens of psychology focusing on three topics: consciousness, agency, and perception. Specifically: what is consciousness, what is it to be an agent, what is it to perceive?"
    },
    {
      "number": "80-275",
      "title": "Metaphysics",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The topical agenda of this course will vary. Typical topics include the problem of personal identity, the nature of human freedom, the nature of the self, the nature of reality and being, the nature of causality, and the question of whether solutions to such problems can be given. Classical as well as contemporary philosophic texts will be studied.\\r\\n\\r\\nFor Spring 2011:\\r\\nIssues we will consider, in no particular order, include: Do properties exist? Why should you think there is an external world? What is a number? Why should you think other people have mental states? What are natural kinds? What constitutes the identity of things through time? What constitutes the identity of persons through time? What does determinism mean? Is there freedom of the will? What is possibility? What is necessity? Are there other possible worlds? When does one event cause another, and what does that mean? What could a deity be, and should you think there is one?"
    },
    {
      "number": "80-281",
      "title": "Language and Thought",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "We use language to communicate. Communication seems to involve something like the transfer of ideas or thoughts from one individual to another. \\r\\nIn this course, we\\222ll try to understand how that works, given that we cannot in fact take our thoughts out of our heads and show them to someone else. We\\222ll explore different views on the relationship between thought and meaning, and different views about how language succeeds in communicating thoughts and ideas. We\\222ll explore the idea of a language of thought, and ask whether the language we speak influences our thought. At the same time, we will want to understand how it is that language hooks up to the world, enabling us to talk not only about what we think, but also about the way things actually are. We\\222ll look at the role of inference in language understanding, and at the nature of non-literal communication, in particular metaphor.\\r\\nThe course will be based on readings drawn from philosophy, linguistics and psychology."
    },
    {
      "number": "85-102",
      "title": "Introduction to Psychology",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course examines major areas of scientific psychology in some depth, the attempt being to develop basic models of our behavior and thought that explain wide areas of our functioning. The primary focus is on the areas of neural and motivational control of behavior, memory and thought, social interaction, and psychological development. Specific topics within these areas include brain function, motivational control systems, learning, cognitive and perceptual information processing, problem solving, obedience and conformity, social interaction, emotion, attitude consistency and change, how our social, cognitive and language functions develop, the importance of childhood to adult functioning, and psychopathology. In addition to the lecture, the course includes a weekly recitation section meeting and weekly short WEB-based laboratory experiences in which students get to perform actual experiments, interpret real data, and experience many psychological phenomena."
    },
    {
      "number": "85-211",
      "title": "Cognitive Psychology",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "How do people perceive, learn, remember, and think? This course will\\r\\nconsider perception, language, attention, learning, memory, reasoning, and\\r\\ndecision making. Experimental findings and formal models will be\\r\\ndiscussed in each part of the course."
    },
    {
      "number": "85-221",
      "title": "Principles of Child Development",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is about normal development from conception through adolescence. Topics include physical, perceptual, cognitive, emotional and social development. Students will learn facts about children at various points in development, theories about how development works, and research methods for studying development in infants and children. Students will be encouraged to relate the facts, theories and methods of developmental psychology to everyday problems, social issues and real world concerns."
    },
    {
      "number": "85-241",
      "title": "Social Psychology",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The focus of this course will be on how peoples behavior, feelings and thoughts are influenced or determined by their social environment. The course will begin with lectures and readings on how social psychologists go about studying social behavior. Next, various topics on which social psychologists have done research will be covered. These topics will include: person perception, prejudice and discrimination, the nature of attitudes and how attitudes are formed and changed, interpersonal attraction, conformity, compliance, altruism, aggression, group behavior, and applications of psychology to problems in health care, law, politics, and the environment. Through readings and lectures on these topics, students will also be exposed to social psychological theories."
    },
    {
      "number": "85-251",
      "title": "Personality",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "    The primary purpose of personality psychology is to understand human uniqueness--how and why it is that one person differs from others, in terms of the ways he or she thinks, feels, and acts. Students in the course will be exposed to several broad theoretical perspectives, each of which attempts to capture and understand the origins and consequences of individual distinctiveness from a slightly different vantage point. Included among these approaches are the dispositional, psychoanalytic, learning, phenomenological, and cognitive self regulation perspectives. This is a survey course and is intended to provide students with a broad background of theory and research in the area. Class meetings consist primarily of lecture, but there is some discussion too. In addition, classroom exercises will allow students to test their own personalities."
    },
    {
      "number": "85-261",
      "title": "Abnormal Psychology",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The study of psychopathology is not an exact science; nor are there many clear-cut parameters with which to differentiate \"normal\" and \"abnormal\" behavior. This course will focus on learning about and understanding the range of behaviors which fall within the province of \"abnormal\" psychology. Its approach will be descriptive, empirical, theoretical and conceptual. Students will examine definitions of \"abnormality\" in an historical and contemporary context, explore issues relevant to diagnosis and patient care, be introduced to various psychological diagnostic categories, and develop an appreciation of the range of treatments for these disorders."
    },
    {
      "number": "88-120",
      "title": "Reason, Passion and Cognition",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "    This course will introduce students to major concepts and theories in the social and decision sciences, focusing in particular on how cognition and emotion shape judgment and choice. We will address such questions as: In what ways do emotions influence judgments and choices? What are some common mistakes in judgment and decision making? Can information shape our choices even if we do not consciously recognize the information? Throughout the course, the emphasis will be on understanding: (1) basic theories and research findings of decision science and psychology, and (2) the relevance of research findings to everyday life."
    },
    {
      "number": "88-260",
      "title": "Organizations",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Even in a \"market\" economy, the preponderance of economic activity is carried out through firms and other organizations. The course begins by examining economic theories of the firm, and explores some of the canonical questions, such as why are there firms, how the separation of ownership and control of a firm shapes decision making, what determines the boundary between organizations and markets (e.g., make-or-buy decisions), what types of firms are most innovative, and how new technologies affect organizational structure. A second set of issues concerns how various organizational forms motivate, or fail to motivate, employees. The central concepts will be fleshed out by examining business firms, as well as not-for-profit enterprises, political parties, and government agencies."
    },
    {
      "number": "19-101",
      "title": "Introduction to Engineering and Public Policy",
      "units": "12",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course examines the processes of public and private decision making and of policy formation, which shape the evolution of a technology and its impact on our society. Technology plays an important role in shaping our worlds. At the same time, social forces often play a central role in the evolution of a technology. A particular technology such as an automobile or computer is chosen to study technology and policy in context. Specific topics covered in the case of the automobile includes automotive design and manufacture, safety, pollution, fuel economy and their interactions. In each area, we discuss the technological and institutional issues, their interaction, the possible need for public policy and the factors that govern the policy. The course will involve several group problem-solving sessions."
    },
    {
      "number": "36-303",
      "title": "Sampling, Survey and Society",
      "units": "9",
      "dependencies": "36-226",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will revolve around the role of sampling and sample surveys in the context of U.S. society and its institutions. We will examine the evolution of survey taking in the United States in the context of its economic, social and political uses. This will eventually lead to discussions about the accuracy and relevance of survey responses, especially in light of various kinds of nonsampling error. Students will be required to design, implement and analyze a survey sample."
    },
    {
      "number": "70-332",
      "title": "Business, Society and Ethics",
      "units": "9",
      "dependencies": "76-101",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The course draws upon actual cases to explore fundamental questions faced by businesses operating in the United States and elsewhere in the world. What justifies governmental regulation of your business? What are the rights of employers and employees? How does the law protect consumers? What laws protect the environment? How do you choose the best legal form for your business? What are the lines of power within a corporation? What protections are available to shareholders? How do the antitrust laws protect competition? What responsibilities does a business have to the community in which it operates? What is the ethical foundation on which business ought to be conducted? The course puts businesses in their legal and ethical context."
    },
    {
      "number": "73-100",
      "title": "Principles of Economics",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Literally, an introduction to economic principles, the goal of this course is to give students an understanding as to what constitutes good \"economic thinking\". This thought process is grounded in the construction and use of economics models. Drawing on issues in both microeconomics and macroeconomics, fundamental principles are shown to transcend particular examples and allow the field to be seen as a coherent, unified whole. (Lecture, 2 hours; Recitation, 1 hour)."
    },
    {
      "number": "73-230",
      "title": "Intermediate Microeconomics",
      "units": "9",
      "dependencies": "21-120,73-100",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is a calculus-based study of microeconomics. Topics in partial equilibrium analysis include supply and demand, consumer theory, theory of the firm, profit maximizing behavior, monopoly theory, and perfect competition. The course concludes with an introduction to general equilibrium analysis and the welfare laws. (Lecture, 3 hours; Recitation, 1 hour). Minimum grade standard of \"C\" applies of only to economics courses. NOTE: Currently, 21-256 is a co-requisite for this course. Beginning in F2015, 21-256 will become a pre-requisite for the course."
    },
    {
      "number": "73-240",
      "title": "Intermediate Macroeconomics",
      "units": "9",
      "dependencies": "73-100,73-230,21-120",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Through macroeconomic models built upon microeconomic foundations, insights are developed into economic growth processes and business cycles. Topics include aggregation and measurement, national income, business cycle measurement, economic welfare theorems and social inefficiencies, the effect of government fiscal policy upon employment and productivity, and the relationship between investment, interest rates and economic growth. (Lecture, 3 hours; Recitation, 1 hour). Minimum grade standard of \"C\" applies of only to economics courses."
    },
    {
      "number": "79-300",
      "title": "History of American Public Policy",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will describe and analyze aspects of the development of public policy in the United States from the colonial era to the present, with a focus on the post-Civil War era. For the purposes of this course, public policy will be defined as the making of rules and laws and their implementation by government: 1) in response to the failure of private actors (i.e., markets) to reach desirable outcomes; 2) to regulate markets to influence their outcomes; or 3) in an attempt to achieve a particular normative vision of what society ought to be like. This course assumes that the public policy landscape is complex but still comprehensible given the proper set of analytical frameworks and appropriate historical background. Particular emphasis will be placed on: changing views about the authority of the government to intervene in economic and social issues; the best way to balance individual and collective interests; and the variability within society of the life courses of individuals. Topics to be covered include: immigration, health care and health insurance, and drug policy."
    },
    {
      "number": "79-331",
      "title": "Body Politics: Women and Health in America",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Women's bodies have been the sites of long-standing, and sometimes deadly, political battles. This course takes a topical approach to the history of American women's health in the nineteenth and twentieth centuries in order to understand why women's bodies have been such heated sites of struggle. It covers topics such as the history of contraception, abortion, menstruation, sexuality, female anatomy, rape, domestic abuse, menopause, pregnancy, and childbirth. It explores how American culture has constructed these issues over time, while also examining women's organizing around them.This course is open to all students."
    },
    {
      "number": "79-335",
      "title": "Drug Use and Drug Policy",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course examines the use of psychoactive drugs in American history, as well as medical, scientific, and policy responses to that use. Drugs we will consider include alcohol, heroin, marijuana, tobacco, and cocaine. We will examine changing theories of addiction, ethnographic studies of drug using groups, and the cultural meanings of drug use. We will also consider drugs as commodities in international trafficking. Although the primary focus is on the U.S., we will look at policy approaches to drug use in other countries as well, to put American drug policy in a comparative perspective."
    },
    {
      "number": "80-135",
      "title": "Introduction to Political Philosophy",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "As an introductory course, we will seek to trace out the historical and philosophical dimensions of the polis from its origins in Ancient Greece to its current manifestation in present-day society. Special emphasis will be placed on the concept of \"democracy.\" The readings and lectures will focus on the history and concept of democracy (as an idea and as an institution); the basic concepts and problems of political philosophy (e.g., liberal and libertarian ideas of justice); and applied political philosophy (e.g., regional initiatives in deliberative democracy)."
    },
    {
      "number": "80-136",
      "title": "Social Structure, Public Policy  & Ethics",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The course will consider ethical questions that arise regarding social structure and public policy\\222s impact on both people and the environment. It will consider the role of political institutions (and, sometimes, individuals) in dealing with some of the greatest challenges facing our generation: World poverty, environmental problems, and globalization. Some of the questions we will consider include: Are developed countries like ours obligated to ameliorate poverty by providing foreign aid, are they obligated to prevent environmental problems, and is globalization and free trade in particular a good idea? The course uses theory, case studies, and empirical evidence to consider these questions from a few different moral and political perspectives. We will extract some economic principles and rational dilemmas from examining these issues and pay attention to how legal and empirical considerations interact with ethical considerations."
    },
    {
      "number": "80-235",
      "title": "Political Philosophy",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "At the heart of political philosophy lie fundamental questions such as: What constitutes a just society? How, and under what circumstances do individuals incur special political obligations to a particular state? What are the limits of the legitimate authority of the state and how are they defined? This course provides a systematic investigation of the way such questions are answered by dominant schools of liberal political theory, such as the social contract tradition, utilitarianism and libertarianism. Because the liberal political tradition is also strongly egalitarian in nature, the course will examine different conceptions of political equality and conflicting views about the respects in which community members may have a just claim to equal treatment. Readings are drawn from classic works by authors such as Hobbes, Locke, Kant, and Mill, and from the works of contemporary theorists like Rawls, Nozick and others."
    },
    {
      "number": "80-244",
      "title": "Environmental Ethics",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The aim of the course is to provide students with an introduction to environmental ethics. One aspect of environmental ethics is the study of values underlying human relations to the natural environment. In particular, we are interested in issues that arise when these values conflict. This course begins with a discussion of our current environmental crises, and different approaches to solving these crises. Many of these solutions, however, depend on particular kinds of knowledge, particularly scientific knowledge, about our environment. Thus, another important aspect of environmental ethics is determining what we do, and what we can, know. To address these issues, we will explore some problems in philosophy of science, with special emphasis on the various eco-sciences."
    },
    {
      "number": "80-245",
      "title": "Medical Ethics",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course provides an introduction to core ethical issues in health care, medical research, and public policy. Topics include: the moral responsibilities of health care providers to patients and various third parties such as the government or insurance companies, the status of health as a social good, and questions of individual liberty and social responsibility at the ends of life including issues such as abortion, physician assisted suicide, and the definition of death. We will also examine specific ethical issues in the conduct of medical research and look at the impact of technological innovation on our notions of health, disease, life, death, and the family. If time permits, we may also discuss issues related to genetics and cloning. While the course engages such substantive ethical issues it also attempts to sharpen students' skills in practical reasoning through argument analysis, analogical reasoning, and the application of theory and principles to particular cases."
    },
    {
      "number": "80-341",
      "title": "Computers, Society and Ethics",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course explores many of the social and ethical issues that have emerged in the wake of the significant advances that we have witnessed in computer science and information technology (IT). Computers and communications technologies have had an increasing impact on the whole of society and have raised new and difficult ethical questions. In turn, these ethical issues have spurred the need for a consideration of new policies and regulations. In this new world of IT, some are concerned about the protection of their privacy while others find problems of censorship and, more generally, restrictions on information access to be their main focus as a problematic social issue. This course will address these and other issues such as: questions of free speech, surveillance in the workplace, intellectual property and copyright, information acquisition and ethics and the Internet."
    },
    {
      "number": "88-104",
      "title": "Decision Processes in American Political Institutions",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This is an interdisciplinary introduction to the study of politics and government, drawing mostly on political science, but also on economics. It familiarizes the student with the basic structures and processes of American government. The main theoretical tools are spatial models of political decision making, and models of collective action problems. The course focuses on politics and government in the United States, but explicit comparisons are made with politics in other countries. Grading is usually based on two midterm exams and a final exam, as well as a short writing assignment, several quizzes and homework."
    },
    {
      "number": "88-110",
      "title": "Experiments with Economic Principles",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is designed to teach the basic principles of economics through the use of experiments. In each experiment you will be an active participant attempting to make deals with other traders in the market. At the end of the experiment it is time to really put economics to the test---can economic theory really explain the complex interactions of the participants in your experiment? One nice feature of these experiments is that you can be both a participant and an observer, and you often will learn nearly as much about economic principles from your experience as a participant as you will from the analysis of the experiment as an observer. Topics covered include basic market behavior, auctions, rent control, pollution, network externalities, information economics, and international trade."
    },
    {
      "number": "88-205",
      "title": "Comparative Politics",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The goal of this course is to use the comparative method to learn about the evolution of political ideas and political systems in selected countries. The course is centered on the study of political ideologies, political systems, institutions, and policies. The course will focus on four countries: China, Cuba, Iran and South Africa and the political philosophy that inspired those regimes structures, foundations, and policies. Each of the case studies will allow the students to learn about the ideology, political institutions, and policies, as well as the political and economic transformation of those countries or regions. Students will be expected to compare political ideologies, political institutions, socioeconomic policies and the consequences that those policies have on the society. The course provides the student with both knowledge about critical political ideas and systems and the skills required to analyze and formulate policies."
    },
    {
      "number": "88-210",
      "title": "Comparative Political Systems",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Why do some countries thrive while others stagnate? Why are some leaders in power for decades, while others last less than a year? When do political protests lead to regime change? What types of political systems produce the \"best\" outcomes? In this class students will learn the art and science of comparative politics. We will ask central questions to understanding how political systems emerge, how they change, and how they survive. To do so, students will learn core theories of comparative politics and be introduced to the major methods of inquiry designed to test those theories. Students will learn to evaluate current events through a comparative politics lens and draw reasoned conclusions by considering contemporary issues in light of the theories covered. Students should be prepared to think critically, analyze complex arguments and data, and apply theories to the \"real world.\" Upon completing the course, students will be well-equipped for advanced study of comparative politics, and will also be able to think like a comparative political scientists as they interpret events in the world around them."
    },
    {
      "number": "88-220",
      "title": "Policy Analysis I",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course provides an introduction to theories and methods for policy analysis. The main focus of the course is to develop an understanding of how theories from social science, such as economics, can help us understand policy issues such as allocation, regulation, and welfare. Throughout the course we analyze outcomes produced by private markets, by examining consumer choice, the supply and demand of factors and produced goods, and general and partial equilibrium. We also analyze the efficiency and welfare properties of such outcomes, paying special attention to the role of policy in influencing market outcomes. We consider how policy can address the efficiency and welfare shortcomings of markets that may result from informational asymmetries, industrial organization, moral hazard, transactions costs, and bounded rationality. Markets are compared in this light with organizational, governmental, and other modes of resource allocation. Grading will be based mainly on 3 exams. Homework assignments and/or quizzes will comprise a smaller part of the grade. Priority access is given to SDS junior and senior students."
    },
    {
      "number": "57-173",
      "title": "Survey of Western Music History",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course surveys the development and contexts of European art music and its global adaptation. While keeping in view the chronology from Gregorian chant to the present, this survey emphasizes key personalities and issues, particularly issues relating to period style and interpretive decisions in performance."
    },
    {
      "number": "60-205",
      "title": "Modern Visual Culture 1789-1960",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Explores the diverse roles of artists in the complexity of modern society from the Industrial Revolution through 1960. Contextual issues include the relationship of artists and art to culture, politics, economics and modern technologies. Attention is paid to the decline of patronage, the diminishing role of the academy and the emergence of an avant-garde and art promotion. Open to sophomores in the School of Art, or by instructor permission."
    },
    {
      "number": "70-342",
      "title": "Managing Across Cultures",
      "units": "9",
      "dependencies": "76-101",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is designed for students who expect to do business in other countries or work with people from other cultures. It provides an intellectual framework for understanding other cultures (and eventually one\\222s own), as well as detailed studies of particular countries. It discusses how culture defines organizations, contracts, personal relationships, attitudes toward authority, time and space, ethics, wealth, and subcultures, and how these affect business. Student teams study a culture of their choice and make presentations, based on interviews and literature research."
    },
    {
      "number": "76-232",
      "title": "African American Literature",
      "units": "9",
      "dependencies": "76-101",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Topics will vary by semester. Consult the course descriptions provided by the department for current offerings. Example, Spring 2012: The purpose of this course is to introduce you to diverse examples of African-American literary expression. You will read canonical works like Fredrick Douglass' Narrative of the Life of Fredrick Douglass, an American Slave, Zora Neale Hurston's Their Eyes Were Watching God and Toni Morrison's Sula as well as not so canonical but more contemporary works like Aaron McGruder and Reginald Hudlin's graphic novel Birth of a Nation, Kyle Baker's comic-series Truth: Red, White and Black and Paul Beatty's Tuff. Along with these primary works this course will also introduce you to the field of African-American literary criticism. These secondary readings will help you explore the historical, aesthetic and political issues that surround these works of art, give you a sense of how criticism functions and the multitude of forms it can take."
    },
    {
      "number": "76-239",
      "title": "Introduction to Film Studies",
      "units": "9",
      "dependencies": "76-101",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will serve as an introduction to the history, form, and theory of film. In the first half of the semester, we will look at the early moments of cinema, tracing the historical development of film form and narrative while investigating the incipient theories that sought to define its methods and effects. Working primarily through Bordwell and Thompson?s seminal text, Film Art: An Introduction, we will also learn the grammar and various approaches to analyzing film. Additionally, we will trace the rise of the Hollywood studio system, understanding and situating its dominance during its ?golden age? by watching movies that both represent and challenge the ?classical Hollywood? mode. In the second half of the course, we will survey several national cinema movements, such as Italian Neorealism and French New Wave. And alongside a wide range of international films, we will consider many of the dominant strains within film theory, e.g., discussing auteur theory and watching an Ingmar Bergman film. To finish class, we will define the place of the big-budget, hybrid-form ?blockbuster? in our increasingly global and interconnected context, interrogating the current state of the movies and movie going."
    },
    {
      "number": "76-241",
      "title": "Introduction to Gender Studies",
      "units": "9",
      "dependencies": "76-101",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will engage with both historical and contemporary scholarship on key questions surrounding the meaning of gender in society. Beginning with ?second wave? feminism, we will trace the development of gender in theoretical and historical work to reflect on its shifting and contingent meanings. We will consider the ways in which gender operates in intersection with categories such as race, class, sexuality, religion, and nationality in global contexts. The course readings will also address how gender as an analytical category is redefined and transformed in an era of globalization, post humanism and new materialisms. We will use keywords and concepts acquired from academic sources to critically analyze themes of gendered performance and representation in literature, film, and television in a range of spheres such as family, culture, work, law, ecology and technology. Requirements for the course include regular participation and weekly blackboard entries, a short paper, a presentation, and a final research paper."
    },
    {
      "number": "79-104",
      "title": "Global Histories",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Human activity transcends political, geographical, and cultural boundaries. From wars to social movements, immigration to environmental change, our world has long been globalized. Acquiring the ability to understand such transnational and even global processes is an indispensable part of any college education. This course provides students with an opportunity to develop the skills and perspectives needed to understand the contemporary world through investigating its global history. A variety of sections are offered in order to give students the opportunity to choose between different themes and approaches. All sections are comparable in their composition of lectures and recitations, required amounts of reading, and emphasis on written assignments as the central medium of assessment. The sections all aim to help students: (1) master knowledge through interaction with the instructors, reading material, and other students, (2) think critically about the context and purpose of any given information, (3) craft effective verbal and written arguments by combining evidence, logic, and creativity, and (4) appreciate the relevance of the past in the present and future. For descriptions of specific sections, see \"First Year Experience\" at the Dietrich College General Education Website: http://www.hss.cmu.edu/gened/."
    },
    {
      "number": "79-207",
      "title": "Development of European Culture",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "    This course surveys the evolution of European culture from 1500-1950. It defines 'culture' broadly to include not only philosophy, literature, and art but also science, manners, sexuality, morality, and religion. Lectures, readings, and discussions will introduce students to European thinking and writing on these questions. The course will place cultural change in the context of politics and society. Readings will include historical studies, novels, plays, and memoirs. Assignments will include six 3-page essay and one 6-page essay."
    },
    {
      "number": "79-222",
      "title": "Between Revolutions: The Development of Modern Latin America",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "When the Haitian Revolution began in 1789, everything south of the newly created United States was under European colonial rule, slavery was an established institution, and the Catholic Church held considerable power over the daily lives of people. However, when the Mexican Revolution began in 1910, Spanish and Portuguese colonialism had collapsed along with slavery, and the power of the church had greatly diminished. New societal institutions emerged that reflected novel ideas about the role of secular nation-states, \"free market\" economies, and the meanings of \"civilization.\" This course will use scholarly writings, fiction, film, and video to analyze the profound changes that took place in Latin American society during and between these two important revolutions. We will pay attention to the lives of both elites as well as the \"everyday\" people who helped to shape the region's history."
    },
    {
      "number": "79-226",
      "title": "Introduction to African History: Earliest Times to 1780",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "A beginning point for this course will be the question: how do historians reconstruct history when few written sources are available? Breaking disciplinary boundaries, the course will draw on linguistics, \"climateology,\" archaeology, and anthropology to reconstruct dynamic social, cultural, political, and economic processes in Africa before the arrival of Europeans and before the availability of written source materials. When written sources are available, the course will interrogate them to illuminate the changes that occurred in African societies during the early period of contact with Europeans. Lastly, by focusing on long-term processes, such as economic specialization, urbanization, and Islamization, the course will begin to put the slave trade in an African-centered perspective."
    },
    {
      "number": "79-230",
      "title": "Arab-Israeli Conflict and Peace Process since 1948",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course begins in 1948 with the establishment of the State of Israel, the Palestinian dispersal and the first of many Arab-Israeli wars, and continues up to the present time. Emphasis is on primary source documents and other source material beyond the textbook such as maps, film, media, photographs, autobiographies and biographies. The examination of the many facets of the Arab-Israeli and Palestinian-Israel conflicts is accompanied by attention to the search for peace and its frustration. The semester culminates in a sustained role playing exercise simulating Arab-Israeli negotiations. Is peace even possible?."
    },
    {
      "number": "79-240",
      "title": "The Development of American Culture",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This is an introductory survey of American history from colonial times to the present. The course focuses on cultural analysis instead of the more traditional emphasis on presidents, wars, and memorizing facts or timelines. The major theme of the course is the changing meaning of freedom over three centuries. Required readings include novels, memoirs, historical documents, and a study of the concept of freedom. There is no textbook; background facts and events are covered in lectures to provide students with context needed to think about and understand America's cultural history. Assignments include exams and essays."
    },
    {
      "number": "79-241",
      "title": "African American History: Africa to the Civil War",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course examines a series of topics--economic, demographic, social, cultural and political--in African-American history from the beginning of the transatlantic slave trade to the Civil War. In addition to changes in race relations, this course also explores the internal experiences of black people within the framework of larger socioeconomic, cultural, and political processes in U.S. history. Although the course includes a general text, assigned readings revolve around detailed studies of particular topics (e.g., work, family, and religion) or chronological periods (e.g., the colonial, revolutionary, and ante-bellum eras)."
    },
    {
      "number": "79-242",
      "title": "African American History: Reconstruction to the Present",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course examines the black experience from Reconstruction to the present. Along with shifting class, gender, and race relations, this course also examines the development of the African American community within the broader context of socioeconomic, cultural, and political processes in U.S. history. Although the course includes a general text, assigned readings revolve around detailed studies of particular topics (e.g., work, family, and religion) or chronological periods (e.g., the Great Migration, Depression, World War II, and the Civil Rights Era)."
    },
    {
      "number": "79-255",
      "title": "Irish History",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course surveys Irish history from the earliest human settlements until the present day, with emphasis on the period since the sixteenth century. Our main objective is to understand the sources of conflict in modern Ireland. In order to do that, however, we look at a number of topics such as the role of religion in Irish society; the causes of population growth, movement, and decline; changing forms of protest; and the formation of rival myths of the Irish past and its meaning."
    },
    {
      "number": "79-281",
      "title": "Introduction to Religion",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The objective of this course is to introduce students to the variety of intellectual disciplines by which religions can be studied and some of the topical concerns of Hinduism, Buddhism, Judaism, Christianity, and Islam. The course asks the question, What is religion? Topics to be covered include religious studies vis-à-vis historical, anthropological, sociological, and psychological approaches to religion; the sacred/holy; myth and symbol; society and the sacred; deity; cosmogony, religious anthropology, theodicy; ethics, eschatology, and secular humanism in the modern age."
    },
    {
      "number": "79-282",
      "title": "Europe and the World since 1800",
      "units": "6",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will introduce students to topics of historical and contemporary relevance in European society and culture from the nineteenth-century to the present. The course will focus on issues of national and cultural identity with special attention to the situation of inhabitants who have been considered outsiders or \"others.\" We shall examine Europe's place in shaping debates--both new and old--about topics such as: religious, ethnic, and national identity; immigration to and within Europe; Islamophobia; antisemitism, and marginalization of the Roma. Throughout the course we shall also consider the shifting meanings that have been assigned to the concept of Europe as well as how these meanings have been contested. In addition to class lectures, students will become familiar with these themes through the reading and discussion of historical and anthropological texts, current political and cultural debates, music and film."
    },
    {
      "number": "79-311",
      "title": "Introduction to Anthropology",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Cultural anthropologists \"make the strange familiar and the familiar strange,\" attempting to understand the internal logic of cultures which might, at first glance, seem bizarre to us, while at the same time probing those aspects of our own society which might appear equally bizarre to outsiders. In doing so, anthropology makes us more aware of our own culturally-ingrained assumptions, while broadening our understanding of the possibilities and alternatives in human experience. This course will use ethnographic writings (descriptive accounts of particular cultures), as well as ethnographic films, to investigate the ways in which diverse societies structure family life, resolve conflict, construct gender relations, organize subsistence, etc. We will assess the advantages and pitfalls of comparing cross-cultural data, analyze the workings of power within and between societies, and consider the politics of cultural representations. We will also discuss the anthropologist's relationship to the people s/he studies, and the responsibilities inherent in that relationship. Throughout the course, students will learn the importance of an historical perspective on culture, looking at how and why societies change, and considering how we, as anthropologists, should assess these changes."
    },
    {
      "number": "79-345",
      "title": "The Roots of Rock and Roll, 1870-1970",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This large-lecture course spans the century from 1870 to 1970 and spends 8 weeks on roots music slave songs, Anglo-Appalachian ballads, ragtime, Tin Pan Alley, and 1920s-1930s blues and country  before you'll hear a single electric guitar. After studying Bessie Smith, Woody Guthrie, Lead Belly, Hank Williams, and other early artists, we'll spend the last 7 weeks on revolutionaries like Chuck Berry, Bob Dylan, Jimi Hendrix, and Janis Joplin. The format is informal lecture and discussion on Tues/Thurs afternoons, plus a required film screening every Wednesday evening, 6:30-9:20pm. Assignments include reading 2-3 books and many articles (including some cultural theory), weekly music listening, four short papers, occasional quizzes, and a final project."
    },
    {
      "number": "79-350",
      "title": "Early Christianity",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "In this course we examine the origins of Christianity. Although we deal with biblical as well as other contemporary materials, the approach is not theological but historical. We want to understand how and why Christianity assumed the form that it did by examining its background in the Jewish community of Palestine, its place in the classical world, its relationship to other mystery religions of the time and certain variant forms (now known as Gnosticism) which it assumed prior to the crystallization of orthodoxy."
    },
    {
      "number": "79-395",
      "title": "The Arts in Pittsburgh",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will examine the arts in Pittsburgh, both historically and in the present. We will focus especially on art exhibits and musical events scheduled by the city's museums and concert halls during the semester. The \"curriculum\" will derive from the artistic presentations themselves, which will provide a springboard for reading assignments, seminar discussions, and research papers in the history of music and art. We will also examine the historical development of cultural institutions in Pittsburgh. The History Department will pay for students' admission to all museums and studios. However, students will be charged a supplemental fee of a minimum of $250 to help subsidize the considerable expense of purchasing tickets for concerts and performances by the Pittsburgh Symphony, Pittsburgh Opera, Chamber Music Society, and Renaissance and Baroque Society. Attendance at all art exhibits and musical events is required. Prerequisite: Availability to attend art exhibits on several Fridays and Saturdays, and to attend musical events on several Thursday, Friday and Saturday evenings."
    },
    {
      "number": "79-396",
      "title": "Music and Society in 19th and 20th Century Europe and the U.S.",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will explore the interrelations between society and classical and popular music in the nineteenth and twentieth centuries in Europe and the United States. We will examine the importance of different musical forms in the life of society and how music contributed to the making of political consciousness, especially in the twentieth century. In addition to reading assignments, seminar discussions, and research papers in the history of music, students will be taken to the performances of the Pittsburgh Symphony, Pittsburgh Opera, and Chamber Music Society. A supplemental fee of a minimum of $275 will be charged to subsidize part of the considerable expense of purchasing tickets for concerts and performances.Prerequisite: Availability to attend musical events on several Thursday, Friday, and Saturday evenings."
    },
    {
      "number": "80-100",
      "title": "Introduction to Philosophy",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "In this introductory course we will explore three major areas of Philosophy: Ethics, Metaphysics, and Epistemology. Accordingly the course is divided into three sections. In each section we will read primary sources and discuss some of the main philosophic problems associated with that area. These will include: moral problems (Ethics), problems rising from the debates about free-will, personal identity or intelligence (Metaphysics), and inquiries about the scope and limits of human knowledge (Epistemology). We will then introduce some theories designed to solve such problems, and try to understand the strengths and weaknesses of these theories. We will apply different techniques and theories to issues that we might encounter in the real world. We will use class discussions, homeworks and papers to learn skills for evaluating arguments. These skills include: how to present a philosophic argument, what are the assumptions that justify it, what are its weaknesses and its strengths, whether such weaknesses can be resolved and, if they cannot be resolved, why."
    },
    {
      "number": "80-250",
      "title": "Ancient Philosophy",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course will cover Ancient Greek philosophy from the pre-Socratics to the later Hellenistic writers. We will prepare the background for Socrates and Plato by tracing the various historical and intellectual movements that led up to and through the flourishing and downfall of Periclean Athens. A study of Socrates (as represented in Aristophanes' comedy and Plato's early dialogues) will lead to an in-depth reading of Plato's Gorgias, Symposium and sections of the Republic. We will approach Aristotle through his 'practical philosophy' as presented in the Nicomachean Ethics. The final sections will discuss the Epicurean, Skeptic, and Stoic movements as well as the work of Cicero. Excerpts from other works of Plato and Aristotle as well as Martha Nussbaum's recent work on Aristotle and Hellenistic philosophy will accompany selected parts of the course."
    },
    {
      "number": "80-251",
      "title": "Modern Philosophy",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Descartes' project to doubt all received knowledge and begin from scratch marked the beginning of an intellectual upheaval, helping to launch what is now called the Modern period of philosophical thought; the Western world is today the heir of modernism. Locke, Leibniz, Hume, and Kant are several of the most important figures of this period. We will examine works of these thinkers, exploring both the new sorts of questions that these philosophers raised and their new methods of doing philosophy, which together mark a fundamental break with the traditions that preceded them. We will devote special attention to the new theories of knowledge they proposed and to their works in ethics and political philosophy. The philosophical revolution of the 17th and 18th centuries occurred during a time of great scientific progress and political upheaval in Europe; as part of our course we will consider the relation of certain of these developments to the new questions and methods of the modern philosophers and to their works in ethics and political philosophy."
    },
    {
      "number": "80-253",
      "title": "Continental Philosophy",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course provides students with an overview of key historical and philosophical movements in European Philosophy. The cultural and historical background for 20th Century Continental Philosophy covers Descartes, Kant, Kierkegaard, and Nietzsche (Hegel and Marx are also options). Early to mid-20th Century Continental Philosophy covers the central tenets of phenomenology and existentialism (e.g., intentionality, Being-in-the-World, Bad Faith). This part will involve selections from the works of, for example, Husserl, Heidegger, Sartre and Merleau-Ponty. Finally, cultural and philosophical trends such as Structuralism, Hermeneutics and Post-modernism (e.g., Derrida, Foucault, Lyotard and Habermas) will be addressed."
    },
    {
      "number": "80-254",
      "title": "Analytic Philosophy",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course examines the revolutionary impact of philosophy at the turn of the 20th century on contemporary thought and progress. By the 1920s some scientists and philosophers became hopeful that the end of the long tradition of philosophical deadlock was finally within reach. Buoyed in particular by Einstein?s theory of relativity and the invention of modern logic, they created a new kind of philosophy with the goal of applying logical and empirical methods to philosophical problems. This new approach led to new puzzles and paradoxes, along with a focus on the age old question of what can be known and what is meaningful. The modern fields of linguistics, cognitive science, and information and computer sciences all owe a debt to these sources, as does of course contemporary philosophy.\\nOur quest will be to understand both what authors like Frege, Russell, and the Vienna Circle were up to in the first place, and how their work contributed to the world we live in today."
    },
    {
      "number": "80-255",
      "title": "Pragmatism",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "American Pragmatism represents an energetic attempt to bridge the divergent cultures of science and the humanities. The movement's founder, C.S. Peirce, was trained in chemistry and worked as a physicist, but he was also deeply concerned with the contemporary philosophical portrayal of science, which distinguished sharply between theoretical knowledge and practice. Peirce responded by constructing a comprehensive philosophy emphasizing the scientific importance of community, fallibility, and action. Pragmatism was also developed and vigorously popularized by William James, who aspired to be a painter and ended up as an acknowledged founder of modern empirical psychology. James extended Peirce's position by defending the role of values in even the purest of empirical sciences. John Dewey, who is also well-known for his role in education, interpreted science as an evolving social system and developed a theory of aesthetics based on what we now call the psychology of problem solving. The pragmatists made and continue to make lasting contributions to modern statistics, logic, and social science and their emphases on community, fallibility, action, and value in science are still of primary importance in philosophy and in the ongoing dialogue between the scientific and humanistic cultures."
    },
    {
      "number": "80-261",
      "title": "Empiricism and Rationalism",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "A central issue in Western philosophy has been whether reason or experience (or some of both?) lies at the foundation of human knowledge, and the 17th and 18th centuries are a defining period of European history because they contribute the basic model of science and the ideals of intellectual and political enlightenment that are still dominant today. Specifically, we will focus on the problems encountered in trying to give an adequate account of the nature of the external world, the structure of our minds, and the nature and limitations of knowledge in the thought of Descartes, Locke, Leibniz, Berkeley, and Hume. The course has two main goals: (1) to study the metaphysical and epistemological theories of selected philosophers, paying close attention to the arguments offered on behalf of often very strange positions, and (2) to help you improve your analytical and critical skills, including, for example, extracting and evaluating philosophical arguments."
    },
    {
      "number": "80-276",
      "title": "Philosophy of Religion",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "In order to expand our ideas about what religion could be, the course begins with a brief cross-cultural review of some major religious traditions around the world. Then we turn to some more traditional arguments for and against theism, including the ontological, cosmological, and design arguments, the argument from religious experience, the argument from miracles and historical testimony, and the problem of evil. We will also consider whether morality ultimately depends on God's sanctions and (yes, here it is at Carnegie Mellon) whether life would be meaningless if God did not exist."
    },
    {
      "number": "82-273",
      "title": "Introduction to Japanese Language and Culture",
      "units": "9",
      "dependencies": "82-171",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is an introduction to modern Japanese. Given the close link between the Japanese language and culture, the examination of the distinctive characteristics of the Japanese language and its sociocultural context provides important insights into contemporary Japan. The course is taught in English. It is intended both for individuals who want to gain a better understanding of modern Japanese society, as well as for students of the Japanese language. Prerequisite: at least 82-171 or permission of the instructor."
    },
    {
      "number": "82-293",
      "title": "Introduction to Russian Culture",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Russia is one of the oldest European countries and long ago achieved world recognition for its outstanding contributions to Western traditions in art, architecture, music and ballet. This introductory course, based on primary documents, secondary readings, film and music, supplies an understanding of the distinctive cultural spirit of this great nation."
    },
    {
      "number": "82-303",
      "title": "French Culture",
      "units": "9",
      "dependencies": "82-202",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The purpose of this class is to advance grammatical, communicative and cultural proficiency, through an in-depth study of France and the French. Attempts will be made at defining the French \"identity\", or what it means to be French, through the study of aspects of French history, French institutions, regions, literature, etc. Examples may be drawn from television and films, songs, and complete literary works, spanning the ages. Great emphasis will be placed on the expression of critical judgment in both oral and written form, documented through readings and personal research."
    },
    {
      "number": "82-304",
      "title": "The Francophone World",
      "units": "9",
      "dependencies": "82-303",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course introduces the students of French to several of the francophone regional cultures outside of France, including North and West Africa, Belgium, Switzerland, Quebec and North America, and the Antilles. The culture commonly associated with the French language is the primarily Christian and Cartesian European tradition. Through the experience of this course, you will learn of the multiple synthetic cultural realities which have arisen through the colonial and post-colonial processes of contact between European and non-European cultures, and which are now expressed through the medium of the French language. Materials studied will include novels, short stories, essays, newspaper and scholarly articles, film, documentary video and song. The course also introduces students to the formal requirements of continuing cultural study, thus assignments will include analyses that demonstrate the ability to express critical judgments in both written and oral form, using accepted academic conventions for research documentation and exposition."
    },
    {
      "number": "82-333",
      "title": "Introduction to Chinese Language and Culture",
      "units": "9",
      "dependencies": "",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "82-333 Introduction to Chinese Language and Culture Modern Chinese Culture. This course will introduce students to important developments in China's culture and language since the end of the nineteenth century. We will focus on the interactions between Chinese and Western cultural traditions and the historical, social and political contexts in which these interactions evolved. Thus we will explore questions like: What is Chinese culture in the modern world? What is modern and what traditional Chinese culture? How does high culture interact with folk culture and popular culture? How have education and language policies shaped Chinese cultural identities over the last century? What does it mean to be Chinese in a diaspora context? Secondary readings, primary documents, and video material chosen for analysis will provide students with important insights into the diverse factors that have been shaping contemporary Chinese culture. This course is conducted in English with no requirement of prior knowledge of Chinese language for students who take it for 9 units. Students who take this course towards Chinese major/minor must register for 12 units (see prerequisites), and extra work in Chinese needs to be completed for the extra 3 units. Prequisites: To register for 12 units, there is a prerequisite of either 82-232 or 82-235 or instructor's approval. No prerequisite for students taking the course with 9 units."
    },
    {
      "number": "82-342",
      "title": "Spain: Language and Culture",
      "units": "9",
      "dependencies": "82-242",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "This course is part of the post-intermediate, 300-level program that forms the introduction to the major or minor in Spanish. Students may begin with any one of the three or they may be taken concurrently. Spain focuses on the cultures of Spain, the autonomous regions and the creation of a national identity as a reaction to the multiple ethnicity's that have inhabited the peninsula since ancient times. The course advances proficiency in grammatical accuracy, the ability to communicate one's ideas in Spanish, and cultural proficiency. The focus of in-class activities is on written and non-written sources such as history, literature, film, art, and elements of popular culture; the building of reading and writing skills will be complemented by continued oral practice in the form of small and large group discussions and class presentations. Treatment of reading selections is designed to increase students general familiarity with a variety of genres, devices, and discourse types and to build a foundation for the department's more advanced courses in literature, history and culture. Writing assignments will involve reflective essays, individualized research, and the generation, expression, analysis and re-writing of ideas. Prerequisite: Completion of 82-242 or the equivalent or permission of the instructor."
    },
    {
      "number": "82-343",
      "title": "Latin America: Language and Culture",
      "units": "9",
      "dependencies": "82-242",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "In this course we will explore Latin American culture and language focusing on issues of cultural identity. Tracing the historical thread of the construction of Latin American cultural identity we will distinguish 6 periods organized around crisis when the topic of ?who we are? becomes a central debate (Larrain 1996). These periods include: the conquest and colonization, the independence and constitution of nation-states, the inter war period and the depression, the 1970?s and the military dictatorships and the present globalization stage. However, it is important to point out that there is no suggestion of continuity or unique experience that represents the diverse groups and societies that constitute Latin America. These phases in the development of a Latin American cultural identity represent the existence of certain dominant discourses and certain controversies that are important in understanding Latin American culture (Larraín 1996). The idea is to explore how Latin America imagines itself and constructs a narrative about its origins and development. There are three main questions we will be exploring through out the course: Where does the discussion about Latin America emerge from?, How does Latin America think of itself?, What does Latin America want to be?. These questions will be explored historically through readings of philosophical and political texts that deal with Latin American identity as well as with literary texts, films and music that represent practices that enact this/ese identity/ies.  Prerequisite: 82-242 or 82-244 or equivalent or permission of the instructor"
    },
    {
      "number": "82-344",
      "title": "U.S. Latinos: Language and Culture",
      "units": "9",
      "dependencies": "82-242",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "The purpose of this course is to provide review and practice of the five skills?reading, writing, listening, speaking and cultural competence?at the advanced level, in Spanish. All work in this course, in the five skill areas, will be stimulated by and be the product of an advanced introduction to and analysis of the cultures and histories of the Hispanic peoples in the United States of America. Many of these people have been and are native born; others are descendants of natives and/or colonizers who resided in North America prior to the arrival of Anglo-Germanic peoples. Many have migrated from Mexico, the Hispanic Caribbean, Central and South America, and Spain during the past two centuries, for economic and/or political reasons. Still others have migrated under special circumstances, as exiles escaping from repressive regimes or from wars in their homelands. Our exploration of U.S. Latino history and culture will compare and contrast the experiences of Hispanics from all three of the above-described categories and analyze the dynamic tension amongst them, with other minority groups, and with the mainstream society. Prerequisite: Completion of the intermediate level or equivalent or permission of the instructor."
    },
    { 
      "number": "82-345",
      "title": "Introduction to Hispanic Literary and Cultural Studies",
      "units": "9",
      "dependencies": "82-342",
      "category": "Humanities",
      "url": "",
      "visible": "FALSE",
      "semester": "",
      "description": "Reading Hispanic Comics: Superheroes and Beyond \\n\\nDespite often being despised and marginalized by intellectual and educated observers, comics and graphic novels have been steadily informing and transforming the Spanish, Latin American, and Latino mass-media and cultural landscapes for decades. How/What can representations of heroes, superheroes, and villains in comics tell us about the Spanish-speaking world? In order to answer these questions, the course offers a survey of popular comics and graphic novels from the Hispanic/Latino world, and provides the skills for reading these works critically as cultural artifacts in terms of what they say and how they say it. We will also use these texts to investigate Spanish, Latin American, and Latino popular culture, narrative, history, and society; their connections with literary texts, socio-historical and cultural contexts, and economic systems; how issues of race, ethnicity, gender and class are addressed in the genre; the (blurring of the) boundaries between the highbrow and the lowbrow; utopias and dystopias; etc. In addition to reading and examining multiple examples of the genre, we will also read materials that will help deepen our understanding of the historical context in which each work was produced, as well as critical theory. Expectations include diligent reading, active participation, written responses, creative and analytical writing, and a final research project. The class is conducted entirely in Spanish."
    }
  ]
}
